{
  "title": "New donation wallpaper!",
  "author": "JGray",
  "date": "04-15-2010",
  "text": "Yep. That turtle's sinister. Evil, I tell you!<br><br>On an unrelated note... well, maybe this is a little evil, too. I wanted to remind folks that Mysteries of the Arcana does accept donations. Any money you gift to us goes to helping maintain the comic. It pays Keith's rates (which he generously prices at far below what it should be) and helps keep our domain registered. If you donate, you get a gift of a neat wallpaper. This month is a very gorgeous rendering of Melody. Certainly, its Keith's most cheesecake heavy MotA related art. Don't believe me? Ask Kludge. Here's a snapshot of his expression when he saw it:<br><br><img alt=\"\" src=\"/pics/aprilteaser.jpg\" vspace=\"\" border=\"0\" hspace=\"\"><br><br>You can donate by clicking on the \"Please Donate\" image of Mandrake to the left of the journal. Thank you!",
  "replies": [
    {
      "author": "weertangel*Guest*",
      "date": "04-18-2010",
      "text": "Hi Jgray, i tried to click that link to tales of the arcana(on the right side)and it went completly crazy! like it was stuck between 2 sites couse it kept switching between them every micro-second!can u guys fix that? <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "JD*Guest*",
      "date": "04-18-2010",
      "text": "That's my fault, Weertangel.&nbsp; The site for Tales from the Arcana isn't quite ready yet, J is working out a new design for it and it will be it's own entity.&nbsp; The link provided on this page goes to where the site was supposed to be, but as it turns out we had to shift it a little.&nbsp; The link will work properly once the new website for Tales is ready to go.<br><br>Sorry!"
    },
    {
      "author": "weertangel*Guest*",
      "date": "04-19-2010",
      "text": "That wicked to hear! can't wait to see it!Maybe u can disable the link till then couse i don't think i'll be the last to click it..."
    }
  ]
}