{
  "title": "Alert!",
  "author": "JGray",
  "date": "04-26-2010",
  "text": "Readers who figure out what today's page title refers to get an official Mysteries of the Arcana no-prize!<br><br>I recently read through the Anime Encyclopedia. It was interesting, if slightly out of date. Bakugan, for example, was missing, but I learned a lot about the Mysterious Cities of Gold, Robotech, and even the Little Prince, all shows I watched as a kid.",
  "replies": [
    {
      "author": "Ketira*Guest*",
      "date": "04-26-2010",
      "text": "<span style=\"font-family: Verdana;\"><font size=\"2\">Does using Google count?&nbsp; I think I watched those movies, but then, there was a lot I watched in those days and don't remember until the name comes back to me.</font><br></span>"
    },
    {
      "author": "Rincewind*Guest*",
      "date": "04-26-2010",
      "text": "I'm guessing the title refers to the giant, jet-propelled turtle, GAMERA!"
    },
    {
      "author": "Victor*Guest*",
      "date": "04-26-2010",
      "text": "Gamera is really neat, Gamera's made of turtle meat, we've been eating GA-MER-A!"
    },
    {
      "author": "LurkerWithout*Guest*",
      "date": "04-26-2010",
      "text": "He isfull of turtle meat!"
    },
    {
      "author": "weertangel*Guest*",
      "date": "04-26-2010",
      "text": "Now thats a BIIGG turtle!! and yes, i have seen something like that before, just don't know where anymore.&nbsp;Btw, i forgot to mention that i like Cryst's safari clothing, purple suits her. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "JD",
      "date": "04-26-2010",
      "text": "I think Keith said something about turtles being carnivorous... <br>The two of them look like tasty little people nuggets in that last panel."
    },
    {
      "author": "JGray",
      "date": "04-27-2010",
      "text": "Using Google counts. I do it all the time.And ya'll are right. Gamera IS full of turtle meat! Or people meat, if JD's right, since this one might snap up the gals..."
    },
    {
      "author": "weertangel*Guest*",
      "date": "04-28-2010",
      "text": "I would't be suprised if there's an entire civilisation in his insides, he sure is big eneugh for it!!makes u wonder what he eats normally...(super giant whales or kelp??)"
    },
    {
      "author": "Gesangbaer*Guest*",
      "date": "04-29-2010",
      "text": "Could it possibly be w reference to the turtle and owl from the old tootsie pop comercials? Mr Owl, who licks 1, 2, 3 ... chomp!"
    },
    {
      "author": "Gesangbaer*Guest*",
      "date": "04-29-2010",
      "text": "Op! Never mind. Wrong comic title, hehehe."
    }
  ]
}