{
  "title": "Television",
  "author": "JGray",
  "date": "05-03-2010",
  "text": "My current cable company doesn't carry BBC America, so I haven't kept up with Doctor Who. I look forward to watching the entire season, later, in one shot.<br><br>I'm also looking forward to the return of Eureka and Warehouse 13. I've been pleasantly surprised, too, by the second half of Stargate Universe's freshman season. I had my doubts but it is winning me over.",
  "replies": [
    {
      "author": "weertangel*Guest*",
      "date": "05-03-2010",
      "text": "Ah, all those tv series i can never get unless i get the Sci-Fi channel....u americans really are lucky when it comes to&nbsp; tv series :(i have recently found a site where i can watch all the Anime series i want, and so far its great!! have also begun following Hellsing and Death Note, i also ordered some manga books who are hopefully here tomorrow, couse i'm getting bored!!Also love the new comic! i wonder what Teresa's quest will be(assuming they don't get blown away...)"
    },
    {
      "author": "JD",
      "date": "05-03-2010",
      "text": "I'm not sure what television has to do with the gigantic turtle, but I don't get any shows.&nbsp; I have a tv, but it's just for watching movies.&nbsp; I do catch some of the interesting shows online though.<br><br>Theresa needs a purpose, the old turtle is correct. What the heck is she there for, decoration?"
    },
    {
      "author": "uhl*Guest*",
      "date": "05-04-2010",
      "text": "Strange that the \"knower\" did not ask Theresa her purpose directly."
    },
    {
      "author": "JGray",
      "date": "05-04-2010",
      "text": "Its a decorum thing. Theresa didn't address it so it starts off by addressing Chrys instead."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "05-06-2010",
      "text": "As I said: Crys:0, Giant turtle: 1. <br><br>Also, isn't that a lot of work for a cloak?"
    },
    {
      "author": "JGray",
      "date": "05-06-2010",
      "text": "If this were an ordinary cloak... <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    }
  ]
}