{
  "title": "Commentary?",
  "author": "JGray",
  "date": "05-13-2010",
  "text": "I am, in general, not one to watch a DVD with the commentary on. Mostly, that's a factor of time. It is hard to find two straight hours in which to watch a movie much less four (two for the regular movie, two for the movie with commentary).<br><br>However, I am aware that many people do enjoy commentary and not just on their movies. So, I am wondering, would you all like more indepth commentary on Mysteries of the Arcana? Information about what went into making a specific page, why certain decisions were made, what references are being pulled out of the ether, and so forth?<br><br>Also, bonus points to anyone who finds the classic literature reference in today's page.",
  "replies": [
    {
      "author": "Katy*Guest*",
      "date": "05-13-2010",
      "text": "Forgive me, I guess I'm just stupid, but what's going on in the comic today? &nbsp;Is she having a panic attack? &nbsp;Or is she so hungry suddenly that she's falling down? &nbsp;I personally (in response to your post) rather like a bit of commentary, but mostly because it helps me understand what is going on in comics like this one where I can't figure out WTF ... :-)"
    },
    {
      "author": "sio*Guest*",
      "date": "05-13-2010",
      "text": "<span style=\"font-family: Comic Sans MS;\">I personally think commentary would be great especially since you said that the comic is going to be starting to deal with deeper themes soon. <br></span>"
    },
    {
      "author": "JGray",
      "date": "05-14-2010",
      "text": "Gunar, got it one. I'm impressed you were even able to link to the page. Good job! <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\"><br><br>Katy, you'll have to keep reading to find out what's going on. I promise it'll become clear as the comic continues. I'm afraid commentary wouldn't help on this one because this part of the story gets told over multiple pages, with this being the first.<br><br>Sio, commentary it is, then. Thank you."
    },
    {
      "author": "*Guest*",
      "date": "05-14-2010",
      "text": "<img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\"> That's my favorite part in that story! <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "weertangel*Guest*",
      "date": "05-15-2010",
      "text": "OH more mystery! lets see what will happen!! maybe Cryst can cure it with a kiss on the lips hehe."
    }
  ]
}