{
  "title": "Shameless Plug",
  "author": "JGray",
  "date": "06-10-2010",
  "text": "Instead of commentary, I'm taking a moment to shamelessly gush about another webcomic. Strawberry Deathcake is about a couple of teenagers who find themselves entangled in the battle against evil at the side of an exorcist in training and an entire organization of somewhat nuts battlers of the supernatural. The art is nothing short of amazing and the writing? Fun as can be. It never gets too heavy and has many moments of fan service and comedy. Like the best comedy based sf/fantasy though (I'm thinking Eureka, for example, or Warehouse 13) it doesn't let the funny get in the way of positive and real character development.<br><br>Best of all? Elliot, the writer/artist, has a unique sense of style. He doesn't rely on the same old D&amp;D objects and magical effects. My favorite? Jack the Ripper's hat. Turns out it wasn't Jack that did the deed. It was his hat making him do it. Check it out by clicking on the link below.<br><br><a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"http://rainchildstudios.com/strawberry/\"><img alt=\"\" src=\"http://mysteriesofthearcana.com/pics/strawberrybanner.jpg\" vspace=\"\" border=\"0\" hspace=\"\"></a>",
  "replies": [
    {
      "author": "weertangel*Guest*",
      "date": "06-10-2010",
      "text": "<img src=\"//smilies/laugh.gif\" alt=\"LOL\" border=\"0\">z, u have a strange sense of humor. did't i ask u to lift Elliot's spirit last week or something couse he had a mental breakdown? but i'm glad he's recovered again =)anyway, go check it out! the Hat is running rampart atm and turning all the hot females in pervert zombies! don't miss out on that action!and love the new page, i saw it coming from&nbsp; 10km away but hey! it needs to start somehow eh? i do hope they knocked out the Kludge before they started making out heh, would't want that old guy watching.."
    },
    {
      "author": "JGray",
      "date": "06-11-2010",
      "text": "Don't worry, Kludge was safely on the other side of the cave-in when it happened. And he wasn't THAT old. He just started going grey in college."
    },
    {
      "author": "Jeyl*Guest*",
      "date": "06-12-2010",
      "text": "Hey, wait a minute. You show us two pictures of \"Quest\" as a baby but not one of Chrys when she brings up her birth? I want my gold back."
    },
    {
      "author": "JGray",
      "date": "06-12-2010",
      "text": "All refunds are handled by the Surgeon.<br><br>[Cheerful statement] This unit would be pleased to refund your payment. Please provide ten points of proof that you purchased the product..."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "06-12-2010",
      "text": "*smirks, but says nothing*"
    }
  ]
}