{
  "title": "Action scenes!",
  "author": "JGray",
  "date": "06-28-2010",
  "text": "Action scenes aren't the easiest things in the world to write. The natural inclination, especially for me, is to see action scenes in my head the way they might take place in a movie. It isn't that simple, however, because I can't just pluck out a few stills from a movie and write them onto a script page. I have to consider how to move the story from panel to panel without overscripting (making it hard to see because there's too much action on a page) or underscripting (making it hard to follow because there isn't enough action to bridge the story from one panel to the next). Today there are only three panels because we're focusing on the sudden surprise of Theresa getting her ass whooped. There'll be much more action on the next couple of pages.<br><br>And, for the record? Not evil rape tentacle goo.",
  "replies": [
    {
      "author": "Ysa",
      "date": "06-28-2010",
      "text": "Wow.&nbsp; O.o&nbsp;&nbsp; Three very powerfull scenes.&nbsp; Damn, its going to take too long till the next update!!! You are&nbsp;cruel men to torture us this way.&nbsp;"
    },
    {
      "author": "weertangel*Guest*",
      "date": "06-28-2010",
      "text": "Ohh!! bash goo!! nice!&nbsp; now lets see how much she can take hehehe \"sadistic laugh\""
    },
    {
      "author": "Elliotd*Guest*",
      "date": "06-28-2010",
      "text": "I know what u mean&nbsp; Ysa. Thursday feels so far away, looking forward to seeing what the goo is all about."
    },
    {
      "author": "Ysa",
      "date": "06-29-2010",
      "text": "<font face=\"Calibri\">You know, I really like the subtle color shift in panel three.&nbsp; How the ground is defined by the darkening of the shade.&nbsp; And the great position Theresa is in when she gets knocked in the back of the head makes me wonder if Keith spent the week knocking his friends in the back of the head so he could find the right pose.&nbsp; JGrey, this is an extremely well planned out page.&nbsp; </font>"
    },
    {
      "author": "Gillsing*Guest*",
      "date": "06-29-2010",
      "text": "Oooh, that goo is much more violent than I expected. Could it be because it's Theresa's goo? Is it a sign of her wanting to beat people up, or a sign of her already mentally beating herself up?\n<br>\n<br>And my captcha for this post was a turtle. Not a green one though, and I see no jungle on its back."
    },
    {
      "author": "JGray",
      "date": "06-29-2010",
      "text": "Thanks, folks!<br><br>Ysa, thank you. Keith did a great job with the gradients on this page. You're right, making them darken as they reached the bottom of the panel was a nifty trick.<br><br>Gillsing, keep thinking. You're on the right track.<br><br>Elliot, you can work on SDC while you wait!<br><br>Weert, you are ebil. EBIL!"
    },
    {
      "author": "uhl*Guest*",
      "date": "06-29-2010",
      "text": "Let's see, green, violent, doesn't say much.. HULK GOO!<br><br>GOO Smash! Goo Bash! Goo No talk trash! {Gurgle}."
    },
    {
      "author": "weertangel*Guest*",
      "date": "06-29-2010",
      "text": "Epic one Uhl!! <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\"> who knows, maybe it morphs into a copy of Teresa on steroids!"
    },
    {
      "author": "Eboreg*Guest*",
      "date": "12-08-2010",
      "text": "*Sniff sniff*<br>I smell ... bad gun safety. (seriously, get your finger out of the trigger guard)"
    }
  ]
}