{
  "title": "The plot thickens!",
  "author": "JGray",
  "date": "07-08-2010",
  "text": "This hasn't been an easy story to write and soon you'll all find out why. Honestly, I've questioned not only my ability to write the story but my right to write it. Still, in the end, it was the story that made the most sense. The story that had to be told. <br><br>Next week, it begins...",
  "replies": [
    {
      "author": "weertangel*Guest*",
      "date": "07-08-2010",
      "text": "Damn! u can&nbsp; literally see the dispair drip off of her!! can't wait to see how debbie died to make her so fearful of remembering it..maybe the standard\" u were in the line of fire\"&nbsp; or the uncommon \"i just followed orders\"??what will it be???\"dum dum dum!\""
    },
    {
      "author": "JD*Guest*",
      "date": "07-08-2010",
      "text": "Wham! Goo-slam!<br><br>I guess there won't be any goo wrestling or jello shots.&nbsp; Theresa is too upset to fight any further, so yeah, need to see what happened to Debbie.<br><br>Also, that goo has grown considerably, wonder what it's been eating."
    },
    {
      "author": "Jeyl*Guest*",
      "date": "07-08-2010",
      "text": "Alright. I'm gona give you the benefit of the doubt on this one. Let's see what we can see."
    },
    {
      "author": "Mitaukano*Guest*",
      "date": "07-08-2010",
      "text": "<span class=\"apple-style-span\"><span style=\"font-size:13.5pt; line-height:115%;font-family:\" arial\",\"sans-serif\";color:black\"=\"\">Oh man.... I have hunches and bad feelings. Maybe I should try to read my tealeaves to figure this one. Man Keith's artwork just keeps getting more phenomenal.</span></span>"
    },
    {
      "author": "Ysa",
      "date": "07-09-2010",
      "text": "Yes, even I have to admit Keith is disgustingly talented.&nbsp; Nice job on the coloring, it truely does the line art justice.&nbsp; But JGrey if you are through torturing us, PLEASE let us know what&nbsp; happened to Debbie!&nbsp; You are just being a tease with all this foreshadowing, its time to put out.&nbsp; Besides, it is the love losts that defines the love nows.&nbsp; And I'm curious to see how this love lost impacts Theresa's ability to embrace what Chrys has to give."
    },
    {
      "author": "JGray",
      "date": "07-09-2010",
      "text": "Next week, everyone. Next week, the truth begins to come out."
    }
  ]
}