{
  "title": "Don't Forget...",
  "author": "JGray",
  "date": "07-15-2010",
  "text": "I just want to remind everyone, we've been doing a page a day all week and will continue to do so until the end of next week. So, if you haven't checked since Monday, make sure to click on the back arrow a few times and see what you've missed.",
  "replies": [
    {
      "author": "Ysa",
      "date": "07-15-2010",
      "text": "Lots of...... um *clears throat* crotch shots there.&nbsp; But I guess that makes sense.&nbsp; Guys always seem to think sex is all about the crotch.&nbsp; But I am curious about on thing.&nbsp; If Theresa had a sexual relationship (whether physically or emotionally) with Debbie, why did she freak out when Chrys kissed her or wanted to cuddle?"
    },
    {
      "author": "weertangel*Guest*",
      "date": "07-15-2010",
      "text": "From what i have seen so far, this might get very interesting!aside from the webcomics i follow, i have become totally hooked to an 80's ,manga named OH! my Goddes! even ordered the 2 first volumes of the series! if u like romance mixed with humor and a little action from time to time, go check it out!! i got me the anime series(2 seasons) the OVA, and the movie(!) so guess what i'll gonna do the rest of the week <img src=\"//smilies/wink1.gif\" alt=\"Wink\" border=\"0\">"
    },
    {
      "author": "JGray",
      "date": "07-16-2010",
      "text": "I won't deny the placement of the kissing scene doesn't have some symbolism but it also happens to be opportunity. That's just where it landed as we moved up the body from feet up."
    },
    {
      "author": "weertangel*Guest*",
      "date": "07-17-2010",
      "text": "Hmmm we have an eyeless unknown person in the saturday update, is that by any chance her dad??"
    },
    {
      "author": "verias",
      "date": "07-17-2010",
      "text": "Nope, not her dad. Go peek back at some of her memory sequences to get a glimpse. It's a trend I've kept to for her flashbacks."
    },
    {
      "author": "Ysa",
      "date": "07-17-2010",
      "text": "Obviously it's \"the boyfriend\".&nbsp; Explaining the whole kiss thing must not be working out very well.&nbsp; He must have been a great guy, because most pigs would be all \"can I watch?\"&nbsp;&nbsp;A kiss is a very intimate thing, I can understand how he would see it as a big betrayal.&nbsp; Especially if he's only made it to first base himself.&nbsp; But serioulsy, if you want to know what Keith looked like in high school, there you go!&nbsp; 'cept with eyes.&nbsp; Green/grey ones.&nbsp;"
    },
    {
      "author": "Ysa",
      "date": "07-18-2010",
      "text": "<span style=\"FONT-FAMILY: 'Arial','sans-serif'\">Oh look, there's the fore mentioned pig now!<span style=\"mso-spacerun: yes\">&nbsp; </span>And he looks familiar too.<span style=\"mso-spacerun: yes\">&nbsp; </span>Anyone else having high school flashbacks?</span>"
    },
    {
      "author": "weertangel*Guest*",
      "date": "07-19-2010",
      "text": "I have a flashback were a girl asked if she could join in to!or is that my imagination again??? so hard to tell sometimes...still,whats the deal with the eyes? are't we allowed to see them?"
    }
  ]
}