{
  "title": "Turtle Returns",
  "author": "JGray",
  "date": "08-05-2010",
  "text": "Hopefully, everyone recognizes that particular style of speech bubble as belonging to the turtle. Or, rather, the giant turtle's translator, the regular sized turtle. I felt it was time she showed up again.<br><br>I just finished rereading the first two books in the Beka Cooper series by Tamora Pierce. I highly recommend everything Ms. Pierce has ever written. She's one of my biggest inspirations as a writer.<br><br>What inspires you?",
  "replies": [
    {
      "author": "Mitaukano*Guest*",
      "date": "08-05-2010",
      "text": "<span class=\"apple-style-span\"><span style=\"font-size:13.5pt; line-height:115%;font-family:\" arial\",\"sans-serif\";color:black\"=\"\">I have to say Tamora Pierce is one of my all time favorite authors and I probably draw a lot from her. My characters end up in their heads a lot ala Ms. Pierce. In addition, I find Mercedes Lackey, and Andre Norton huge inspirations for writing stable female main characters good and bad.&nbsp;</span></span>"
    },
    {
      "author": "LongshotLink*Guest*",
      "date": "08-05-2010",
      "text": "Did Tamora Pierce write the books with Death being a fairly main character? Because I remember a book like that, but am not sure."
    },
    {
      "author": "SoySauce*Guest*",
      "date": "08-05-2010",
      "text": "From fiction? Probably the Saw series inspires me (just went through a marathon ^_^). A plan complex in its conception, simple in its execution, and very nearly perfect in its design. Books with a similar background I'd say are the Ender books by Orson Scott Card and Name of the Wind, by Patrick Rothfuss."
    },
    {
      "author": "Uhl*Guest*",
      "date": "08-05-2010",
      "text": "I thought that was a Narnia reference myself. Aslan is always saying \"son of Adam\" and \"Daughter of Eve\" when speaking to someone."
    },
    {
      "author": "JGray",
      "date": "08-06-2010",
      "text": "Mitaukano, I would have to name Beka Cooper and Keladry as my two favorite Pierce heroines. I'm also fond of all four Circle kids. I've never been able to fall into Mercedes Lackey quite so easily but love Diane Duane's Wizard books.<br><br>Longshotlink, no. That's not a Pierce book. It could be one of Piers Anthony's Incarnations series (Riding a Pale Horse) or possibly Amber Benson's debut novel about the daughter of death?<br><br>Soy, good, tight plots are important. Oddly, I found \"Dude, Where's My Car\" to have one. Also, any book by Robert Parker. The man knew how to do snappy dialogue while keeping his plots tight and noiry.<br><br>Uhl, Daughter of Eve is a Narnia nod, absolutely. I was just mentioning Tamora Pierce because she's currently on my to-read list."
    },
    {
      "author": "JanaiOssum*Guest*",
      "date": "08-06-2010",
      "text": "Tamora Pierce is definitely the person who inspires my writing the most. She has such a way with words, and people, and places. Beka is awesome, but Alanna and Daine were always my favorite heroines and Numair is my favorite guy. The circle kids rock too. Especially Tris."
    },
    {
      "author": "Ysa",
      "date": "08-07-2010",
      "text": "I am first and will always be an Andre Norton fan, she is my inspiration to become a writer.&nbsp; But I also lean towards the darker desires of Anne Bishop.&nbsp; Bishop captures the true nature of the human animal and the depth of our darker nature.&nbsp; I also find it appealing that Satean is a bewildered old geezer.&nbsp;"
    },
    {
      "author": "weertangel*Guest*",
      "date": "08-07-2010",
      "text": "I am not a writer, but i find the works of writers Ricard A. Knaak and&nbsp; R.A. Salvatore to belong to some of the best series of the last years <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">&nbsp;"
    },
    {
      "author": "JGray",
      "date": "08-08-2010",
      "text": "I'm glad to hear everyone has favorites and is willing to share. Thank you!"
    }
  ]
}