{
  "title": "Couldn't Resist",
  "author": "JGray",
  "date": "08-19-2010",
  "text": "I couldn't resist the Ripley reference. She and Theresa even share similar hairstyles. I bet T is wishing she had a construction power suit right about now...",
  "replies": [
    {
      "author": "j*Guest*",
      "date": "08-19-2010",
      "text": "Um i noticed this for a while now but as far as I know nobody asked.&nbsp; Do you know your comments go up before the new strip or is something not updating correctly on one end or the other?"
    },
    {
      "author": "verias",
      "date": "08-19-2010",
      "text": "It's less his fault and more mine. He posts the comments retroactively the day prior to update. The server is on like west coast time or something so they go live at 10pm where I live. And I post the page at some point during the day/night as I'm able to complete it."
    },
    {
      "author": "Uhl*Guest*",
      "date": "08-19-2010",
      "text": "Just one problem with the construction power suit. It wouldn't work. Goo girl would just climb up into it and strangle T do death, or just \"bitch slap\" her silly."
    },
    {
      "author": "Ysa",
      "date": "08-19-2010",
      "text": "Oh!&nbsp; I thought it was all done purposefully to torture us for JGrey and Keith's perverse pleasure.&nbsp; I check the page and read J's comment, then spend half the night refreshing the page, dying to see what he's talking about.&nbsp; Refreshing and throwing vile comments at my computer.&nbsp; Then all of a sudden, there's the new page!&nbsp;&nbsp; And I am happy!&nbsp; A little cartoon sun rises, and little birds wearing top hats sing, and tiny unicorns dance across my desk (this is all done in carebear animation in my mind because I have absolutely no artistic talent).&nbsp; And then I reach the bottom of the page..............&nbsp;&nbsp;&nbsp;&nbsp; What's Next!!!!!&nbsp;&nbsp;&nbsp; The torture begins anew!!!!!!!!!!&nbsp; I think JGrey and Keith are evil!&nbsp; I know for a fact Keith is!&nbsp;&nbsp;"
    },
    {
      "author": "Jeyl*Guest*",
      "date": "08-19-2010",
      "text": "ALIENS reference? +1!"
    },
    {
      "author": "unknown (just go with it)*Guest*",
      "date": "08-27-2010",
      "text": "OMG THIS IS A GOOD COMIC!!!!!! Will you make more cuz im craving more."
    }
  ]
}