{
  "title": "Intervention?",
  "author": "JGray",
  "date": "09-23-2010",
  "text": "What Chrys did here might be considered something like an intervention. The only way to face a problem is to admit you have one, and sometimes you need someone else to give you a push.<br><br>Of course, now Chrys might be getting a push. Right off that cliff.",
  "replies": [
    {
      "author": "Ayra*Guest*",
      "date": "09-23-2010",
      "text": "Hmm... I'd say that after what Chrys said, she SLIGHTLY increased her chances of not getting pushed down that cliff. Even though Theresa obviously hates what Chrys forced her to do, she still understand that it was for her own good.And now I bet&nbsp;I'll be proven wrong&nbsp;on monday&nbsp;and she'll get shoved right down that cliff."
    },
    {
      "author": "Uhl*Guest*",
      "date": "09-23-2010",
      "text": "She may STILL be pushed off that cliff, not intentionally mind you, but pushed nonetheless. Or the cliff may just give way on its own. Crumbling ground tends to do that."
    },
    {
      "author": "SoySauce*Guest*",
      "date": "09-23-2010",
      "text": "Theresa let Chrys finish a sentence. I'd say she's calm enough to not send her to her death. I'm not ruling out walking away and flashing her lesbian elf friend the one-digit salute, though."
    },
    {
      "author": "SoySauce*Guest*",
      "date": "09-23-2010",
      "text": "Then again, since she was just forced to deal with the reason why she's denied any lesbian tendencies, maybe she'll kiss Chrys? Probably not now, but guy can hope, right?"
    },
    {
      "author": "Slacker*Guest*",
      "date": "09-25-2010",
      "text": "Here's a thought: Why not try and ASK, first? Instead, she said \"I know better than you what you need, shut up and I'LL FIX YOU!\"\n<br>\n<br>Major dick move. \n<br>\n<br>I, for one, favor the one finger salute and walk off."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "09-25-2010",
      "text": "Two words for what Chrys did: Superman Comics."
    },
    {
      "author": "Jeyl*Guest*",
      "date": "09-25-2010",
      "text": "\"Of course, now Chrys might be getting a push. Right off that cliff.\"\n<br>\n<br>If Chrys is pushed over the cliff, I'll destroy this comic and all it's assets if Theresa shouts \"You brought this on yourself!\". I will not have bad memories be brought back to haunt me or anyone else who shared my experiences!"
    },
    {
      "author": "KS Claw*Guest*",
      "date": "09-27-2010",
      "text": "Chrys, you might have helped her in some way, but you did it in the worst way possible. And even if you don't get shoved off the cliff, it will be a long while before you're properly forgiven. <br><br>People with something like that weighing on their minds and not wanting help? Well... When they do get help, they tend to bite the head off the person 'helping'. I speak from experience <img src=\"//smilies/confused4.gif\" alt=\"Confused\" border=\"0\">"
    }
  ]
}