{
  "title": "What happened?",
  "author": "JGray",
  "date": "11-15-2010",
  "text": "The question was asked: what happened to William's home arcana. The answer? Horrible, horrible things. We'll be exploring that before this story ends, I promise.<br><br>In the meanwhile, things aren't looking good here, are there? Riders on ants. Dogboys with bricks. Theresa could be in a real pickle...",
  "replies": [
    {
      "author": "Ayra*Guest*",
      "date": "11-15-2010",
      "text": "Man, they really should use those awesome-looking bricks for making durable houses instead of using them to knock people out."
    },
    {
      "author": "Ysa",
      "date": "11-15-2010",
      "text": "Sometimes&nbsp;a friend&nbsp;\"becomes an&nbsp;&nbsp;enemy in order to remain a friend\"&nbsp;&nbsp; William is to&nbsp;cute and puppyish&nbsp;to be a bad guy. So he could be knocking Theresa out to save her life.&nbsp; I remember reading that females are rare and highly valued for breeding purposes on William's Arcana.&nbsp; And besides, Theresa's been needing some sense knocked into her for a while."
    },
    {
      "author": "Wolfgang*Guest*",
      "date": "11-15-2010",
      "text": "Where are those shadows coming from?"
    },
    {
      "author": "quarktime*Guest*",
      "date": "11-16-2010",
      "text": "I think this is a good time to remind everyone to spay or neuter their pets..."
    },
    {
      "author": "verias",
      "date": "11-16-2010",
      "text": "So, when William and Theresa were sent out, William wanted to go \"clubbing\"? *badum tish*"
    },
    {
      "author": "JD*Guest*",
      "date": "11-16-2010",
      "text": ""
    },
    {
      "author": "Eric Tolle*Guest*",
      "date": "11-16-2010",
      "text": "Or maybe he just got tired of her 'tude. I mean, you don't go dissing a guy's ex, or his pile of rubble."
    },
    {
      "author": "Felix Pleșoianu*Guest*",
      "date": "11-17-2010",
      "text": "I agree with Eric Tolle. Seriously, how insensitive can Theresa be? You don't go visiting somebody's home and start insulting it.\n<br>\n<br>Suddenly, she's a lot less likeable. :-/"
    }
  ]
}