{
  "title": "Meanwhile...",
  "author": "JGray",
  "date": "11-22-2010",
  "text": "I know many people (well, some people, anyway) are eager to find out what's happened to Theresa. Will she be alright? Has William betrayed her? Where did that brick come from? Most of these questions will be answered... eventually.<br><br>However, this chapter isn't just the story of William and Theresa. There's also Chrys and Mandrake. And I don't think Chrys's fans would like to wait several months before she shows up. So, we'll be switching back and forth between the two pairs (with occasional interludes to show what Melody and Kludge are up to). <br><br>In the meanwhile, can you figure out what all the science fiction flick references are in the second panel of this page? Most of them are pretty easy.",
  "replies": [
    {
      "author": "Eboreg*Guest*",
      "date": "11-22-2010",
      "text": "Dehydrated water? Is there even such a thing?"
    },
    {
      "author": "Ayra*Guest*",
      "date": "11-22-2010",
      "text": "I'm mostly curious about where the brick came from personally: If they got bricks they should use them instead of rotten wood for their homes! Although, knocking people out with rotten wood wouldn't work terribly well, so maybe they have things in order after all.And nah, I don't think Dog Boy has betrayed Theresa. If William really had betrayed her, he wouldn't have tried to mellow out his blow in the first place: He'd just have swung as hard as he could have. Of course, if he did have to knock her out to protect her, odds are that she's not in an entirely safe position either...I'd say Chris got lucky: Sometime shopping malls are more horrible than bricks to the head, but that doesn't seem to be her case there...And for the references, well... I still stand by my point that I'm blind to them!&nbsp;"
    },
    {
      "author": "Xinoth*Guest*",
      "date": "11-22-2010",
      "text": ""
    },
    {
      "author": "JD*Guest*",
      "date": "11-22-2010",
      "text": "Nope.&nbsp; I guess the references are easy to someone with a memory, but my mind has more holes than swiss cheese, probably due to all those yummy mad-cow sticks.<br><br>Soylent powder... <span style=\"font-style: italic;\">is made from people!</span>&nbsp; It's made from people!!<br>Slan brain sounds oddly familiar.<br>Dehydrated water, hmm?&nbsp; You could fit an entire ocean into one tiny canister..."
    },
    {
      "author": "VoidHamlet*Guest*",
      "date": "11-22-2010",
      "text": "Brick to the head... sounds like a \"I'll deal with this better if you serve as my loot before those guys\" or a \"pushing you into another realm via rude awakening\" move. Or neither. Heh.<br><br>Well, I for one am tied up with the dragon thread, pun intended. Whatever is this about? <img alt=\" LOL \" src=\"//smilies/laugh.gif\" border=\"0\" hspace=\"2\" vspace=\"2\">"
    },
    {
      "author": "Elliotd*Guest*",
      "date": "11-22-2010",
      "text": "I like that you're going to be bouncing back from Theresa's team to Chrys's team. Really keeps you wanting to know whats going to happen either teams.<br><br>Couldn't figure out the references, I've watched a lot of fantasy/scifi shows but maybe some of these references are from books. In which case, theres no chance in hell I'll figure em out, <img src=\"//smilies/laugh.gif\" alt=\"LOL\" border=\"0\"> XD."
    },
    {
      "author": "JDG*Guest*",
      "date": "11-23-2010",
      "text": "<span style=\"font-family: Arial;\">I really don't recall triffids having anything that could be perceived as ears, though I have to say: kudos for pulling a sci-fi reference that old out of the air. :D<br></span>"
    },
    {
      "author": "Ysa",
      "date": "11-23-2010",
      "text": "1. Futurama(?)2. Space Quest3. Soylant Green4. A.E van Vogt5. John Wyndham6. Anne&nbsp; McCaffrey"
    },
    {
      "author": "WCCope*Guest*",
      "date": "01-27-2011",
      "text": "1 Charlie Brown (Lucy teaching Linus \"facts\")"
    },
    {
      "author": "Johan*Guest*",
      "date": "06-09-2011",
      "text": "You know that mall looks like the wheels or Professor X's wheelchair ... then again, it's a very simple design so ... Do you guys know you can actually buy dehydrated water? I stumbled on a website dedicated to that one day, I couldn't believe it.&nbsp; <br>I got the soylent green reference but ... that's it. I agree with JD though, the slan brain thing ... I'm sure I know that from somewhere ..."
    }
  ]
}