{
  "title": "Good Morning",
  "author": "JGray",
  "date": "12-02-2010",
  "text": "I'd like to, first, apologize to Fes. He's been trying to get together with Keith and I to do an interview for his podcast, the <a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"http://webcomicbeacon.com/\">Webcomic Beacon</a>, and my life has just conspired to get in the way every time.<br><br>Next, we got reviewed! <a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"http://rainofgods.blogspot.com/\">I Am Legend</a>, a webcomic review site, was kind enough to give Mysteries of the Arcana a very positive recommendation. This is our first \"professional\" review as a webcomic and I'm very pleased with it.<br><br>Finally, a bit of trivia to lighten the morning. <br><br>Did you know most of the main characters have a signature color? Chrys's is purple. Theresa's is green. William's is purple. Mandrake's is black. Kludge's is blue. This determines the color of the vortex storm that transports people from arcana to arcana via the royal road.",
  "replies": [
    {
      "author": "adamas*Guest*",
      "date": "12-02-2010",
      "text": "I detect alot of purple in those colors. And YEESH that was a quick snatch."
    },
    {
      "author": "Uhl*Guest*",
      "date": "12-02-2010",
      "text": "SO I take it nobody's quest is going quite as planned, eh?"
    },
    {
      "author": "Ayra*Guest*",
      "date": "12-02-2010",
      "text": "Congratulations on your review!Chrys and Mandrake will surely have fun trying to catch something that goes that fast... Maybe they should just go buy the stuff again, but I doubt that's what they are going to do <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\"> Especially since Mandrake seems awfully bumed about losing her new shoes...Regarding monday's (?) page, I think those are really wise words that unfortunately don't always apply... Or that sometime that they do apply, but that it takes nearly an entire lifetime.For the color things... I see Melody missing from the list! Always forgotten... *snif*"
    },
    {
      "author": "Ysa",
      "date": "12-02-2010",
      "text": "What a wonderful review! Congrats guys!&nbsp; Although honestly your page was much easier to navigate and highly more entertaining than that nerd who only gave you a review of a 8.5.&nbsp; Lets be honest here, MotA isn't even 2 years old yet!&nbsp; There are always atleast 30 people waiting for updates at the midnight hour.&nbsp; And 6-8 comments per page of highly intelegent conversation and inquires are far better that 50 comments on how a stack of pancakes look like an erection.&nbsp; A quick look at the members list alone shows what an appreciation your fans have for MotA.&nbsp; And we love watching all the&nbsp;guest become part of the family.&nbsp; So I say this, regular guest please register, and members don't forget to sign in!&nbsp; Lets really show the next nerd that these guys deserve a solid 10!BTW I bet Melody's color is red.&nbsp;&nbsp; And Chrys is being an uppity bitch.&nbsp; She had a hard time talking about her dad and sugar coated a lot of that story, but thinks its her right to \"fix\" Theresa?!&nbsp; The only effective way to help someone with serious problems is to be quietly supportive and step in only when asked or not step in at all.&nbsp;&nbsp;Sometimes you can \"help a person too much\" and then&nbsp;things just get worse.&nbsp; Playing mind games only leads to mistrust and broken hearts."
    },
    {
      "author": "*Guest*",
      "date": "12-06-2010",
      "text": "ROYAL RAINBOW!"
    },
    {
      "author": "Johan*Guest*",
      "date": "06-09-2011",
      "text": "Again, I Iove Mandrake's reaction : My shoes!!! I wanna see her in hight heels and evening gown now ^^<br><br>And Ysa, you're right. And wrong. But Right. I dunno. I think Chrys acted out of fear, not just to help Theresa. She said she was afraid Theresa's secrets were going to kill her. I'm pretty sure she saw that happenning to other people. And well ... I think anger is easier to overcome than pain ... or not. Hard to say, I never take that kind of decisions without a hell lot more information. I only did something like that once, and the person got better, which is good cuz I didn't really know what I was doing.Oh well."
    }
  ]
}