{
  "title": "Adventure Shows for Girls",
  "author": "JGray",
  "date": "03-10-2011",
  "text": "I'd like to take a moment to think about animated adventure shows that had female protagonists. For a while, it seemed like girl power was a major force but I've noticed that, in recent years, female characters have fallen to the back again. So, I thought I'd celebrate some of the great animated adventure shows with female leads from the past. <br><br>Kim Possible: Maybe the very best of them. A world trotting teen who could do anything. In a twist on a familiar trope, the girl is the hero while the boy is the bumbling sidekick. <br><br>My Life as a Teenage Robot: XJ9 (aka Jenny) is trying to be a normal teen while at the same time she's a robot built to save the world from... pretty much everything.<br><br>The Powerpuff Girls: One of the foundation blocks of modern girl power, the Powerpuff Girls are made from sugar... spice... everything nice... and CHEMICAL X! <br><br>She-Ra: Princess of Power: During the 80s, the toy companies saw great success with product/show combos such as He-Man and Transformers, so they tried to duplicate that success shows and toy lines targeted to girls. She-Ra was He-Man's sister. In some ways, she's the mother of the modern animated female.<br><br>Jem and the Holograms: Like She-Ra, Jem was as much a toy commercial as a show. It is classic, bad 80s glam rock but the theme song gets stuck in your head like nothing's business. Find the cover by Freezepop sometime. It is fab!<br><br>Recent shows seem to be returning to the two boys for every one girl formula. Young Justice has four male heroes (Robin, Aqualad, Superboy, and Kid Flash) and two female heroes (Miss Martian and Artemis). Zevo-3 has two boys, one girl. And the new power rangers? Three boys, two girls with the girls being pink and yellow. Once again, the red ranger's a white guy.",
  "replies": [
    {
      "author": "Fairportfan*Guest*",
      "date": "03-10-2011",
      "text": "Peter David's original \"Young Justice\" comic had three guys (Robin, Superboy and Impulse) and three girls (Wonder Girl, Arrowette and Secret).  Later they added Slobo (a teen-age Lobo) and Empress."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "03-10-2011",
      "text": "Actually the two girls, three guys combo started with the original MMPR but the suits and stock footage used was from Zyuranger and that team was 4 guys and 1 girl. (The difference between the two was yellow)"
    },
    {
      "author": "JGray",
      "date": "03-10-2011",
      "text": "Ayshara - Indeed, Power Rangers is limited by the show it takes footage from. Still, there's no reason the red ranger can't be someone of color. It has been done in the past (Mystic Force).<br><br>Fairportfan - Whatever other problems I had with the Young Justice series (it got a little too silly at times and I've never been fond of Impulse as a character) gender balance was not one of them."
    },
    {
      "author": "Ketira*Guest*",
      "date": "03-10-2011",
      "text": "<font class=\"Apple-style-span\" size=\"2\">....and this is why I've gone over to Japanese animation: &nbsp;they have a whole <b>genre</b>&nbsp;not only for girls, but usually has a girl leading them. &nbsp;I first got hooked on Anime with such a show: &nbsp;<i>Sailor Moon</i>&nbsp;--and I haven't regretted it. &nbsp;I've also liked <i>Ghost in the Shell</i>&nbsp;and the stand-alone series as well (yes, they're on my wish list).</font>"
    },
    {
      "author": "ericthetolle*Guest*",
      "date": "03-10-2011",
      "text": "Here's a couple more series you might be interested in, if you like strong female protagonists:<br><br>Cyber-6: A short yet beautiful French series with a plot remniscent of Cyborg 009, and artwork influenced by Aeon Flux. Our superheroine is the last of an army of cyborgs created by a mad scientist. In order to survive, she has to fight his minions, while at the same time, getting involved with a local teacher. http://www.youtube.com/watch?v=x3TWKNurt1M&amp;feature=related<br><br>WITCH: At times silly, it still has well developed and strong characters, and one of the smartest villains around- the kids don't simply win because he's stupid. http://www.youtube.com/watch?v=jIBq-z7vdMo&amp;tracker=False&amp;NR=1<br><br>Serei no Morbito: Basara the spearwoman, in order to atone for the deaths of eight people has vowed to save eight people; but can she really save a prince without killing anyone? This series breaks a huge number of fantasy anime tropes, and not just by having an older woman as a protagonist. As the series progresses, you realize nobody really operates on \"anime logic\". One of the best anime series I've seen in the last few years. http://www.anime-sub.com/watch/moribito-guardian-of-the-spirit.html<br><br>Anyway, I've been enjoying the comic, and I'm glad that you seem to be in it for the long haul. I'm looking forward to seeing what comes up next."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "03-10-2011",
      "text": "Cyber 6 was a good show, it's a pity it got cut short at 13 episodes. I know there's a comic out there but it's not in English nor at this time will it be localized."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "03-10-2011",
      "text": "Also the cartoon itself was produced in Canada, though it has strong anime undertones due to a partnership with an animation team - the comic itself was made and produced in Spanish I believe (go ahead and correct me if I'm wrong)."
    },
    {
      "author": "JGray",
      "date": "03-10-2011",
      "text": "I should have remembered to include WITCH. I specifically avoided Japanese shows or would have included Sailor Moon."
    },
    {
      "author": "ericthetolle*Guest*",
      "date": "03-10-2011",
      "text": ""
    },
    {
      "author": "ericthetolle*Guest*",
      "date": "03-10-2011",
      "text": ""
    }
  ]
}