{
  "title": "Cons",
  "author": "JGray",
  "date": "03-28-2011",
  "text": "A lot of webcomic readers enjoy going to cons. Chances are, several of you are going to cons at some point this year. I offer this word of warning: be careful who you buy art from. <a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"http://www.bleedingcool.com/2011/03/24/who-on-earth-is-rob-granito/\">A man named Rob Granito has been making the con circuit rounds for quite some time, pretending to have comic cred (working for Marvel, DC, Disney, and more) and selling what are essentially tracings of art done by other artists.</a> He's been called out on this now and, my guess is, he won't have much look in the future.<br><br>However, this particular crime isn't limited to this man. While few frauds will be as outrageously fraud-a-licious as Mr. Granito they're still out there, selling both at cons and onlines. If you buy art, just take a moment to ensure that you're buying something authentic. Chances are, no one is going to be ripping off webcomics on the level of Mysteries of the Arcana, but that original Wonder Woman you're buying might actually be a tracing of something done by George Perez. <br><br>Protect yourself.",
  "replies": [
    {
      "author": "TC*Guest*",
      "date": "03-28-2011",
      "text": "New page made me rofl HARD.<br><br>And frauds like him are why I don't buy anything claiming to be authentic."
    },
    {
      "author": "*Guest*",
      "date": "03-28-2011",
      "text": "Ah, long time no see u guys! and i see that the comic has really gone forward! interesting storylines and big shocks for theresa! <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">can't wait till i see the explanation of the \"horrors\" <img src=\"//smilies/laugh.gif\" alt=\"LOL\" border=\"0\">!i've fallen to a manga Adiction, hence te reason i barely read any webcomics. but i'm (slowly) trying to pick it up again <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">&nbsp;"
    },
    {
      "author": "weertangel*Guest*",
      "date": "03-28-2011",
      "text": "Ah, long time no see u guys! and i see that the comic has really gone forward! interesting storylines and big shocks for theresa! <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">can't wait till i see the explanation of the \"horrors\" <img src=\"//smilies/laugh.gif\" alt=\"LOL\" border=\"0\">!i've fallen to a manga Adiction, hence te reason i barely read any webcomics. but i'm (slowly) trying to pick it up again <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">&nbsp;edit, sorry, forgot to add my name. should be better now."
    },
    {
      "author": "adamas*Guest*",
      "date": "03-28-2011",
      "text": "To the comic I can say only one thing: MINE EYES! THEY BURN!!!!"
    },
    {
      "author": "Gillsing*Guest*",
      "date": "03-29-2011",
      "text": "Those are truly the most hilarious horrors I have ever seen. Kill them with fire."
    },
    {
      "author": "Azure*Guest*",
      "date": "03-29-2011",
      "text": "What the heck are tennis players doing in the middle of the desert? And then why are they smiling? Oh, the horror, the horror!"
    }
  ]
}