{
  "title": "A new question!",
  "author": "JGray",
  "date": "04-11-2011",
  "text": "The alternative title for this page is 'Lesbian Horror Kisses'. <br><br>I'm pretty excited about this action sequence. It has been dynamic and unconventional. Sarrah's done a great job penciling, inking, and coloring it!<br><br>Now, I have another question for you! Today, I'm asking, who is your favorite MotA character and why?",
  "replies": [
    {
      "author": "Fairportfan*Guest*",
      "date": "04-11-2011",
      "text": "Theresa.  Looking forward to watching her start to figure out who she is <i>now</i>."
    },
    {
      "author": "Mitaukano*Guest*",
      "date": "04-11-2011",
      "text": "Oh man such a hard choice! I love Chrys, Theresa, Mandrake and William so much.&nbsp;"
    },
    {
      "author": "Bunneh*Guest*",
      "date": "04-11-2011",
      "text": "Theresa. Gotta be Theresa. :3"
    },
    {
      "author": "Nightlyre*Guest*",
      "date": "04-11-2011",
      "text": "William.C'mon, he defeated a freakin' sentient black hole. He rules."
    },
    {
      "author": "Pseudo*Guest*",
      "date": "04-11-2011",
      "text": "<span style=\"font-family: Arial;\">I would like to see more of the surgeon.&nbsp; It seems such a sad little machine intelligence; scheduled for destruction despite performing so well, betraying it's larger self and reaching out to desperate enemies, and now untrusted and disliked by everyone.&nbsp; It deserves a few pages of plot and a chance to further redeem itself.</span>"
    },
    {
      "author": "adamas*Guest*",
      "date": "04-11-2011",
      "text": "Mandrake. I have a weakness for purple-skinned image-speaking faerie type folk....That and she's just so CUTE!"
    },
    {
      "author": "Mei*Guest*",
      "date": "04-11-2011",
      "text": "Mandrake. can't beat floating picture messages. plus, she flies. can william to that? hm?"
    },
    {
      "author": "salaheg*Guest*",
      "date": "04-11-2011",
      "text": "My Favorite is Theresa she's the most realistic character."
    },
    {
      "author": "TC*Guest*",
      "date": "04-11-2011",
      "text": "I think the title needed a few more Y's, to give it that George Takei-esque style of awesome.<br><br>And I love how the rainbow was the confirmation pic.<br><br>Now I wonder about the male horror.&nbsp; rofl"
    },
    {
      "author": "adamas*Guest*",
      "date": "04-11-2011",
      "text": "TC , I can just see his reaction. \"I must do WHAT?!\" :D"
    }
  ]
}