{
  "title": "Thank you, Sarrah!",
  "author": "JGray",
  "date": "05-25-2011",
  "text": "I'm posting this page a day early for two reasons. First, because it is just awesome. Second, because this is Sarrah's last page of Mysteries of the Arcana and I felt that deserved some small celebration.<br><br>Not so long ago, I found myself in a fix. Life had made it hard for Keith to keep up as artist of MotA. I put out a frantic call for help and Sarrah responded, ready to work, with a great deal of webcomic experience. She came into an unfamiliar comic and really delivered, putting out each page on time, with style and skill. <br><br>Hiatus is a nasty word in the webcomic world. It can mean the death of a comic as readers get tired of waiting. There are plenty of webcomics out there and a regular schedule is essential to keeping people's attention. Sarrah made sure our hiatus was only a week or so long. <br><br>Today's page was something of my gift to Sarrah. I wanted to make her last page something fun and I wanted to give her a chance to draw our two most visually interesting characters. <br><br>So, Sarrah, thank you! I don't know what MotA would have done without you! By the way, everyone should go check out Planes of Eldor. The link's to the right of the comic itself. It is an awesome comic with strong writing and strong art.<br><br>Next Monday, Jessica Cantlope takes over as the artist on this storyline. I'm really looking forward to it!",
  "replies": [
    {
      "author": "Ayshara*Guest*",
      "date": "05-25-2011",
      "text": "All I have to say concerning this announcement is: I can't wait!"
    },
    {
      "author": "Azure*Guest*",
      "date": "05-26-2011",
      "text": "Why would anyone cook ROBOTS?"
    },
    {
      "author": "Mei*Guest*",
      "date": "05-26-2011",
      "text": "wel, their captors are probably cavemen, who haven't learned about technology yet. hm...."
    },
    {
      "author": "adamas*Guest*",
      "date": "05-26-2011",
      "text": "A robot and a humanoid goo in a spacesuit... umm umm that's some good eatin'!"
    },
    {
      "author": "Azure*Guest*",
      "date": "05-31-2011",
      "text": "Their captors must be hugely iron deficient."
    }
  ]
}