{
  "title": "Welcome Jessica",
  "author": "JGray",
  "date": "05-29-2011",
  "text": "With today's page, Jessica Cantlope steps up as the artist of Mysteries of the Arcana. Jessica is the creator of <a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"http://www.lovefeast-comic.com/\">Lovefeast</a> and <a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"http://www.millennium-comic.com/\">Millennium</a>, two excellent webcomics. Her art and color work has always impressed me so I was pleased when she said she'd sign on with us. Jessica will be the artist of MotA at least through the end of this story.<br><br>Say hello, everyone!",
  "replies": [
    {
      "author": "Ayshara*Guest*",
      "date": "05-29-2011",
      "text": "As an artist in her own right she does very good work, with that being said though, I must disagree with it working with MotA; it looks rather jarring to me."
    },
    {
      "author": "JGray",
      "date": "05-29-2011",
      "text": "I admit, moving from one style to another can take some getting used to. If I had a choice, I wouldn't do it in the middle of a storyline."
    },
    {
      "author": "Felix Pleșoianu*Guest*",
      "date": "05-30-2011",
      "text": "I, for one, welcome the new artist and intend to give her a chance. Maybe the added cartoonish-ness will soften up the tone a little -- sometimes it's just too mature."
    },
    {
      "author": "rachel",
      "date": "05-30-2011",
      "text": "Welcome, Jessica! I will admit that the art style is different. But I think it still captures the essence of the characters and conveys their expressions and feelings. So I fully intend to give Jessica my support and praise. (I certainly couldn't draw so well.) I'm also looking forward to witnessing the resolution of these current storylines. Hooray for character development!"
    },
    {
      "author": "Weertangel*Guest*",
      "date": "05-30-2011",
      "text": "Welcome Jessica!Well, as said, it will take some time to getting used to, but maybe after this storyline is done we can give a more definite answer.&nbsp;"
    },
    {
      "author": "Hushicho*Guest*",
      "date": "05-31-2011",
      "text": "Welcome Jessica!<br><br>I am a longtime fan and friend, and I think she's fabulous. I know she'll please you as a talented artist and creator. Give her a chance and you will be delighted. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Azure*Guest*",
      "date": "05-31-2011",
      "text": "Welcome, Jessica.&nbsp; It's going to take a bit of getting used to this 2-d layering type art, but at least the characters are still recognizable, and their affects haven't changed all that much."
    },
    {
      "author": "wendal*Guest*",
      "date": "05-31-2011",
      "text": ""
    },
    {
      "author": "Senshuu*Guest*",
      "date": "06-01-2011",
      "text": "Thank you so much, everybody. &lt;3<br><br>I was initially worried at how my style(s) would work out with MotA. I want to try something slightly different from both of my comics, but it hasn't quite manifest yet. I'm sure it will over time.<br><br>James approached me with confidence, and I'm ever grateful for it."
    },
    {
      "author": "Thebes*Guest*",
      "date": "06-01-2011",
      "text": "Welcome, Senshuu. I didn't recognize you with the new style. Going for a western look this time around?"
    }
  ]
}