{
  "title": "250!",
  "author": "JGray",
  "date": "07-15-2011",
  "text": "It somehow seems appropriate that Chrys's dad make his first appearance in our 250th page.<br><br>See, this whole thing started with him. Once upon a time, I started making up stories about a dashing, interdimensional traveler. It wasn't Chrys. Or Theresa. It was Quest. Over time, I grew up and didn't need to Mary Sue so much and the storyline evolved to be about his daughter and, eventually, about his daughter and her girlfriend.<br><br>Still, it is nice that, on our 250th page, he shows up... in the flesh. <br><br>Previous page is in color, by the way!",
  "replies": [
    {
      "author": "Mitaukano*Guest*",
      "date": "07-15-2011",
      "text": "Is it worrysome that since you mentioned Quest I've been eagerly waiting for him to show up? I'm very interested to see what happens since they have both been caught. Don't feel too bad about the Mary Sue-ing, we all do it at one time or another. Also at least your's isn't a giant crazy Were-cat/Bastet.&nbsp;"
    },
    {
      "author": "adamas*Guest*",
      "date": "07-15-2011",
      "text": "Yes I was right!"
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "07-16-2011",
      "text": "Okay i'm not going to make any \"like a fungus\" cracks, but the art is beginning (slowly) to grow on me.\n<br>\n<br>Are youse guys doing something different in the colouring?  The colours seem brighter, somehow."
    },
    {
      "author": "Ellaanabeth*Guest*",
      "date": "07-16-2011",
      "text": "Um... What happened to Chrys' purple stripes in her hair? Did they dissapear when&nbsp;I wasn't looking? O.o"
    },
    {
      "author": "James*Guest*",
      "date": "07-18-2011",
      "text": "I'm sorry but it must be said. The art work is not doing it for me as it did in previous pages. It's like giving away your Farrari for a Taurus, a cool car to show off for a family car everyone had. Her art work maybe good for other comics but for this one, the original artist style was what brought people to it. I only stay for the story because it is still interesting. <br><br>I think you people are being a little too polite. I'm not saying we should be against simple forms of art, but, honesty rather then \"don't hate me\" politeness isn't a bad thing to practice once in a while, it may even help in some good way."
    },
    {
      "author": "Xade*Guest*",
      "date": "07-18-2011",
      "text": "good work, purple streaks coming? hope so, she looks like a dumb blond without them, the straks add personality to her and matches her lips."
    },
    {
      "author": "James*Guest*",
      "date": "07-18-2011",
      "text": "Well sorry if I have an opinion, asshole."
    },
    {
      "author": "JGray",
      "date": "07-18-2011",
      "text": "You are, of course, allowed to have an opinion. Xade wasn't denegrating it. No one was. Calling people names isn't cool, though. Please do not do so again."
    },
    {
      "author": "Gillsing*Guest*",
      "date": "07-19-2011",
      "text": "I'm guessing James thought Xade was calling him \"a zero\" with the \"Loved the zeros comment on the one before.\" Which actually seems to refer to the last panel of page 249, and not at all to the previous comment.<br><br>A lot of times it's a good idea to turn the other cheek at perceived insults or attacks, because sometimes they're just mistakes on someone's part, and retaliation just makes things worse. And hey, even if it's an actual verbal attack, it already reflects poorly on the attacker, so as far as I'm concerned, there is really no point in name-calling even as retaliation."
    },
    {
      "author": "James*Guest*",
      "date": "07-19-2011",
      "text": "You ever been picked on your whole life just for being born something? I don't take shit from no one. I just wanted to voice an opinion, and to see something that looks like a response to you makes me feel like I'm not welcomed. I like this comic and I am looking forward to seeing more of it in the future, and I don't like coming into a place that makes me feel unwelcomed."
    }
  ]
}