{
  "title": "That was fun",
  "author": "JGray",
  "date": "09-01-2011",
  "text": "Well, everything's more or less back to normal. Damage was minimal. Life's gone on. The basement will have to be plugged up somehow so this doesn't happen again.<br><br>I had a pretty good birthday. A nice dinner. Some fun presents. I got a copy of Ogre Tactics: Let Us Cling Together for the PSP. I also got the newest Dresden Novel and a few books on homesteading and country living, which is very nice. I'll probably pick up Disgaea 4 on Tuesday or Wednesday.<br><br>This page came out well. Gennifer did a great job. Obviously, the relationship between Theresa and William has deepened and evolved during this storyline. Theresa's had a chance for a bit of personal growth thanks to William's words. Chrys will soon have her moment of growth, too. When this is over she and Theresa will be more capable of friendship and eventually? Maybe even more.",
  "replies": [
    {
      "author": "Phill*Guest*",
      "date": "09-01-2011",
      "text": "I love that last panel.&nbsp;"
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "09-01-2011",
      "text": "Puts me in mind of the <i>Wapsi Square</i> strip where Bud asked Jin (who knew she was slipping into schizophrenia and seeing things and people who weren't there - a worrying condition to friends who are aware that the slowly-slipping personage could literally blow out the Sun with a thought) how she knew what was real.\n<br>\n<br>And Jin, with a complete poker face, reached out one finger and gently poked Bud in the boob..."
    },
    {
      "author": "Guest*Guest*",
      "date": "09-02-2011",
      "text": "I'm probably in the minority that likes Theresa/William. It will never happen, but I just think they're cute. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\"> At least they can be good friends."
    },
    {
      "author": "Nina*Guest*",
      "date": "09-02-2011",
      "text": "I LOVE how William is drawn now!!!"
    },
    {
      "author": "Gennifer Bone*Guest*",
      "date": "09-02-2011",
      "text": "Glad you like my William!"
    },
    {
      "author": "Ayshara*Guest*",
      "date": "09-05-2011",
      "text": "*snickers over last panel*"
    }
  ]
}