{
  "title": "Fall!",
  "author": "JGray",
  "date": "09-12-2011",
  "text": "This is one of my favorite times of the year. The weather is turning cooler but not intolerably cold. The leaves are beginning to change colors. I'll love it right up until they fall and it is time to rake them all up.<br><br>The question was asked, why not just send William back to the Tower for occasional vacations? Why do they need Vitamin X back at the Inn? The answer was guessed at over in the shout box. The best way to deliver the Vitamin X to William is in daily doses. He requires less than a quarter of a tea spoon a day.<br><br>Now, did Theresa just destroy a monster? Or kill an innocent skeleton?",
  "replies": [
    {
      "author": "adamas*Guest*",
      "date": "09-12-2011",
      "text": "Seem a bit jumpy to me. And Theresa, babe, when your trying to sneak into a building stuff to bursting with insane, near invincible creatures... USE A SILENCER!!! :P"
    },
    {
      "author": "James Smith*Guest*",
      "date": "09-12-2011",
      "text": "Death to the Dead!"
    },
    {
      "author": "Gillsing*Guest*",
      "date": "09-13-2011",
      "text": "It was a justified shooting. It was a zombie! Just like the one sitting behind the window in the engine in the previous page. It may even have been the same one, and he just moved to the door to surprise them. But she sure showed him!"
    },
    {
      "author": "Magic_luver101*Guest*",
      "date": "09-13-2011",
      "text": "When do you post new comics now?"
    },
    {
      "author": "Ayshara*Guest*",
      "date": "09-13-2011",
      "text": "Heh, I pegged it. &nbsp;*tilts head* Is it just me or does the whole Vitamin X/Zombie thing a blantant reference to Resident Evil?"
    },
    {
      "author": "Ayshara*Guest*",
      "date": "09-13-2011",
      "text": "*is not does"
    },
    {
      "author": "JGray",
      "date": "09-13-2011",
      "text": "This is nothing like Resident Evil! My zombies are plasticized yuppies! Not grotesque tentacled monsters! Totally different.<br><br>Magic_luver101: We update on M/Th but at the moment I can't promise midnight updates."
    },
    {
      "author": "Magic_luver101*Guest*",
      "date": "09-13-2011",
      "text": "Ok you just did not put it up again once the comic started back up again so I wasn't sure if it was just random update days now. I don't care if its at midnight or if it at 8:00pm I am OCD about what day it updates on because i have so many i have to check that i need to know what day its on otherwise i miss pages."
    },
    {
      "author": "JD*Guest*",
      "date": "09-13-2011",
      "text": "Sure hope that zombie has a good dental plan, he's gonna need it.<br><br>Theresa, chill a little, would ya?"
    },
    {
      "author": "James Smith*Guest*",
      "date": "09-14-2011",
      "text": "My favorite time of year, too. Or at least anytime that is overcast."
    }
  ]
}