{
  "title": "Scientifically accurate?",
  "author": "JGray",
  "date": "10-17-2011",
  "text": "I fully expect some readers to cry foul over this one.<br><br>Why? I'm not going to advertise. If you don't figure it out I'm quite happy. If you do, then I'll be glad to explain why it isn't as bad as it seems. :)<br><br>Some badass William coming later this week!",
  "replies": [
    {
      "author": "adamas*Guest*",
      "date": "10-17-2011",
      "text": "Interesting solution."
    },
    {
      "author": "JD*Guest*",
      "date": "10-18-2011",
      "text": "Yeah, jump starting a truck with a taser isn't too likely, plenty of volts but not enough amps.&nbsp; What the hell though, it's in another universe, physics could be completely whack there.&nbsp; I'll continue to suspend disbelief."
    },
    {
      "author": "Johan*Guest*",
      "date": "10-18-2011",
      "text": "I'm with JD on this. Plus using raw water will cause battery failure ... but it's not really important right now I guess ^^<br>Also I adore your story, so I'm not saying this suck or anything, I love the way you write and this is a great arc."
    },
    {
      "author": "Uhl*Guest*",
      "date": "10-18-2011",
      "text": "LOL, saw the name brand on the battery! <img src=\"//smilies/wink1.gif\" alt=\"Wink\" border=\"0\"> One thing Theresa forgot. GAS! It's probably all evaporated by now."
    },
    {
      "author": "JD*Guest*",
      "date": "10-18-2011",
      "text": "Yeah, if the truck runs on gasoline it would have turned to high octane varnish by now.&nbsp; But again, different universe... The truck could run on liquid propane, or cockroach farts for all we know."
    },
    {
      "author": "Antonious*Guest*",
      "date": "10-18-2011",
      "text": "I figure that if you can jump start a car using a device that is nothing more than a really large number of AA batteries taped together, then why not jump start a vehicle using a taser."
    },
    {
      "author": "James Smith*Guest*",
      "date": "10-19-2011",
      "text": "Someone should tell Mythbusters about this, this would be a good one."
    },
    {
      "author": "adamas*Guest*",
      "date": "10-19-2011",
      "text": ""
    },
    {
      "author": "JGray",
      "date": "10-19-2011",
      "text": "Clever, Adamas. That is, indeed, not a taser from the Hierophant (aka our Earth). The water is plain old water, though. I admit its bad for the battery."
    }
  ]
}