{
  "title": "A looong time coming",
  "author": "JGray",
  "date": "12-12-2011",
  "text": "The moment that is playing out right now in the comic has been a long time coming. In fact, it was one of two primary goals I set forth when I began writing this chapter. I won't spoil, but let's just say each of our two main characters - Theresa and Chrys - have learned an important lesson in chapter three.",
  "replies": [
    {
      "author": "Fairportfan*Guest*",
      "date": "12-13-2011",
      "text": "Isn't that what your daughter's friends are <i>for</i>?\n<br>\n<br>\n<br>Not to be picky or nasty, but the art's getting kind of scratchy/scrappy..."
    },
    {
      "author": "rachel",
      "date": "12-13-2011",
      "text": "I will admit, Gennifer's style is quite different from what MotA started with, and that takes some getting used to, and the latest pages have definitely highlighted some of those differences. But to be honest, I think the art is quite beautiful. The wealth of detail - especially in a supposedly featureless cell while they are effectively just a pair of talking heads - is excellent. There are real expressions, both in face and in body posture. And it really is showing off the father's ... Patrician? ... attitudes and bearing.<br><br>Everyone is entitled to their own opinions, obviously. But I wanted to speak up in support. I know how it can feel when all you hear is the negative, while you yourself are working so hard. I don't ever want anyone to face that if I can help it."
    },
    {
      "author": "Gillsing*Guest*",
      "date": "12-13-2011",
      "text": "Well, Chrys isn't looking her best when her eyes are that far up on her head. Long face is looong. Her dad is looking quite spry though. :-)"
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "12-15-2011",
      "text": "I'm not saying it's bad - but it's a change, and a bit of a surprising one."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "12-15-2011",
      "text": "I agree with Gillsing, Chrys' eyes in that last panel..."
    },
    {
      "author": "Gennifer*Guest*",
      "date": "12-15-2011",
      "text": "I'm not sure what to say about her eyes, really, I've just always put a certain amount of interpretation to the human figure...&nbsp; Still, it's good to hear constructive criticism."
    }
  ]
}