{
  "title": "Well...",
  "author": "JGray",
  "date": "12-30-2011",
  "text": "Mandrake isn't magically changing sizes here. There's some forced perspective going on as she moves closer to and farther away from the \"camera\". :)<br><br>My rule of thumb with Mandrake's \"picture speech\" is to express the meaning, not the spelling. A thumbs up meaning yes. A sun meaning hello. A smiley face meaning happy. However, some words are incredibly hard to translate into images that can be quickly and easily understood by everyone. 'Well' and 'I dunno know' are a case in point. Thus, for this one time, in panel 2, I expressed the spelling of a word and not the meaning of the word. I hope you all can forgive me.<br><br>On another note, this is the last comic of 2011! We'll be continuing the story next year, of course. <br><br>With that in mind, I ask the readers an important question: What do you want from Mysteries of the Arcana next year? Something related to the story? A trade edition? A new website? Bonus features? Let us know what would help keep you here. The turmoil of artistic changes this year lost us quite a few readers. I don't intend to pander, of course, but I do need to start growing this comic again.",
  "replies": [
    {
      "author": "Ketira*Guest*",
      "date": "12-30-2011",
      "text": "<font face=\"Verdana\" size=\"2\">Re: comic - Why belabor over one word if it's conveyed the way everyone will understand? &nbsp;I understood Mandrake just fine.... &nbsp;</font>"
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "12-30-2011",
      "text": "Aaaah~ i confess i had been wondering about mandrake XD i was beginning to think she developed size changing powers ^_^\n<br>\n<br>\n<br>Well im the sort who really loves universe development (i get a real kick out of finding out more about the many worlds of your amazing comic)  and so long as the comic continues to explore its own universe while the real story rolls along i will be quite estatic ^_^\n<br>\n<br>\n<br>your website looks fine and original, i dont see much point in changing it ^_^;\n<br>not quite sure what you mean by a trade edition\n<br>and as for extra features it already looks quite splendid ^_^ (though i really loved those 'kludges notes' pieces) \n<br>\n<br>\n<br>Ketira has a good point though on one thing ^_^; your comic could be better advertised.\n<br>Perhaps you could try link exchanges with other webcomics in an effort to bring more people over here?"
    },
    {
      "author": "Tyr*Guest*",
      "date": "01-02-2012",
      "text": "just from an art point of view, I like the coloring, but I think maybe before you draw the lineart, you might want to draw guides and rough it out first. but yeah. I understand that this is being put out under deadlines. It's just that I think it might help get more consistant results and eventually make it easier to draw more quickly."
    },
    {
      "author": "JSmith*Guest*",
      "date": "01-02-2012",
      "text": "\"Well\"-- clever."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "01-02-2012",
      "text": "Jasae: By Trade Edition J means a printed copy.<br><br>I agree with the link exchanges, another thing your readers can do as well is tweet your account as part of a #FF. (Yes, I will keep doing this, just let me know if it's helped you at all) Also, I wrote a short back before the truth about Debbie got revealed. Did you need it again so you can upload it to the site?"
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "01-04-2012",
      "text": "ah i see, thanks ayshara for clearing that up ^^\n<br>hmm...to answer that question I think it would be awfully neat but it might be a bad idea at this time to have a trade edition. at least not until you have picked up the comics popularity a bit ^^;\n<br>\n<br>\n<br>wells i dont tweet but i can spread the word ^^"
    }
  ]
}