{
  "title": "Illness",
  "author": "JGray",
  "date": "01-06-2012",
  "text": "After the holidays, a wave of the flu swept through my family. It knocked me off my feet for a while and then traveled on. Long and the short of it? It can be very hard to write when dealing with rebelling stomachs. Gennifer was nice enough to send me this filler piece to round out the week.<br><br>Next week, we'll be finishing up Chrys's storyline in Two by Two and then there'll be a special treat for all you Chrys/Theresa shippers!",
  "replies": [
    {
      "author": "adamas*Guest*",
      "date": "01-06-2012",
      "text": "Hope everyone's feeling better Hoss. And yeah, 'Ressa would be the one with the .45 Thompson. Nice image Gennifer <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "01-06-2012",
      "text": "pffft XD theresa is totally a mobster XD \n<br>and chris fits that role too well XDDD\n<br>\n<br>good luck! i hope you make a great recovery before long!\n<br>\n<br>\n<br>hmm...i wonder what would happen if someone stuck a block of granite or something on the location of a arcana door thingy..."
    },
    {
      "author": "Gennifer*Guest*",
      "date": "01-07-2012",
      "text": "Glad everyone likes this. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Ayshara*Guest*",
      "date": "01-09-2012",
      "text": "It's a good picture but you could have drawn anything, Gennifer, and called it noir. A noir film is called such because of how they did the lighting back then (translating to shading for pictures), yes, most gangster movies were/are noir but not all of them can be called that."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "01-09-2012",
      "text": "If you want a recent example of how noir is meant to be done, look up the first episode of the anime Noir and pay attention to the animation instead of the story line, especially in the scenes inside the half completed building."
    }
  ]
}