{
  "title": "Protest",
  "author": "JGray",
  "date": "01-18-2012",
  "text": "This page has been censored in protest of the Stop Online Piracy Act and similar legislation.<br><br>Normally, I try to avoid politics with MotA (though our support of LGBT issues is pretty apparent). However, this seems to important.<br><br>If you live in the US, please let your congressperson know you do not support this legislation (if you don't, of course). If you live elsewhere in the world, please let your representatives know you don't want similar legislation.<br><br>The full version of this comic will be up at the end of the week. Thank you for your patience.",
  "replies": [
    {
      "author": "James Smith*Guest*",
      "date": "01-18-2012",
      "text": "I just learned about the SOPA while visiting a Star Trek fan fiction site I liked, the whole site in \"blacked\" I can't even use the forum because there's no homepage to link it to. This is an outrage and unconstitutional in the US, and it doesn't even work anyway, the pirates are just going to find another way to get work done."
    },
    {
      "author": "Brian B*Guest*",
      "date": "01-18-2012",
      "text": "When you have the final page up, will Chrys's hair have the purple in it?"
    },
    {
      "author": "JGray",
      "date": "01-18-2012",
      "text": "Yes. Also, Mandrake will have her wings. Genn sent me a draft page with the censoring done. That'll make it easier down the road. I tend to get confused easily and might put up the censored page instead of the real one!"
    },
    {
      "author": "Uhl*Guest*",
      "date": "01-19-2012",
      "text": "Politicians can always be expected to do something stupid because their pet lobbyist thinks it's a good idea."
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "01-19-2012",
      "text": "For funness i shall make wild assumptions as to what their saying in the comic~\n<br>\n<br>panel 3: i will just walk through this door and be home free nothing can go wrong~ 8D\n<br>panel 4: dang, i just jinxed it &gt;_&lt;\n<br>panel 5: mandrake~ go sneak into J's office and rewrite the script!\n<br>Title: meta meddling \n<br>8D"
    }
  ]
}