{
  "title": "Theresa",
  "author": "JGray",
  "date": "01-23-2012",
  "text": "Mysteries of the Arcana began in its present form as Chrys's story. As I began developing it, however, I realized the story needed two things. First, it needed a love story. Second, it needed a point of view character.<br><br>An point of view character serves as a proxy for the reader. When a story universe has a complex history and rule system it is helpful to make one of the major characters an outsider. Someone to whom the universe has to be explained. Harry Potter's a perfect example of this. He knows nothing about the wizarding world and, so, it doesn't seem out of place when absolutely everything needs to be explained to him. If Harry were raised with a full wizard family, it would feel stilted and awkward if someone explained Quiddich to him. Since Harry is an outsider he needs to be educated and as a result the reader is educated as well.<br><br>Having decided to introduce a love interest/point of view character, I began brainstorming. I didn't need to do so for long. Theresa, like Athena from Zeus's head, emerged fully formed. Short dark hair. Army jacket. Love of guns. Somewhat short tempered personality. Deciding she was Catholic came after realizing that love at first sight was boring. There needed to be struggle and conflict along the road for Theresa and Chrys's relationship.<br><br>I also knew I wanted to start off with her marching to her doom and finding a reason to live. The reason for Theresa's desire to kill herself evolved over time but was firmly in place by the time the comic debuted. I'm very glad. In a lot of ways, Theresa has overtaken Chrys as the \"star\" of Mysteries of the Arcana. She's a great character.",
  "replies": [
    {
      "author": "Pseudo*Guest*",
      "date": "01-23-2012",
      "text": "Still want a peek under her bonnet..."
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "01-23-2012",
      "text": "oh lordy....an old jalopy of a truck with tank treds and a 'beast' liscenece plate...\n<br>that looks totally awesome! XD\n<br>and i know that song~\n<br>\n<br>\n<br>ah this is interesting ^^  though to nitpick a little bit, while it is harder to use in comic form there is a method around making a point of view character and that is making the reader themself the point of view character and have the main explain things to the reader.\n<br>though for obvious reasons it works better in written form XD\n<br>\n<br>neat to know what brought about our favorite gun toting arcana character!"
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "01-24-2012",
      "text": "So Theresa'a a motorhead, too, huh?\n<br>\n<br>\n<br>She needs to meet Ash over at <i>Misfile</i>."
    },
    {
      "author": "JGray",
      "date": "01-24-2012",
      "text": "Theresa knows how to work on cars and enjoys it but she's not the budding professional that Ash is. A Misfile/MotA crossover would be fascinating but I suspect people would have trouble telling Ash and Theresa apart. They're visually quite similar."
    },
    {
      "author": "TC*Guest*",
      "date": "01-24-2012",
      "text": "^____________^&nbsp; I now have this song stuck in my head.&nbsp; I see Theresa can appreciate a classic."
    },
    {
      "author": "adamas*Guest*",
      "date": "01-24-2012",
      "text": ""
    },
    {
      "author": "JGray",
      "date": "01-25-2012",
      "text": "True. In color, they are visually different. Theresa has black hair and darker skin than Ash. In black and white, which is Misfile's preferred format, she and Ash would be visually similar. Shorter, yes. About the same build, though."
    },
    {
      "author": "JSmith*Guest*",
      "date": "01-26-2012",
      "text": "Are those Legos or Duplos?"
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "01-26-2012",
      "text": "Ash is rather larger up top.  36C."
    },
    {
      "author": "JGray",
      "date": "01-26-2012",
      "text": "Theresa is a 32C, so Ash is larger.<br><br>JSmith, those aren't either. We don't violate trademarks here at MotA. Nope! <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\"><br>Last edited by JGray<br>Edited 1 time(s)."
    }
  ]
}