{
  "title": "The first story",
  "author": "JGray",
  "date": "01-31-2012",
  "text": "<span style=\"font-weight: bold;\">Note: I've been invited to participate in an online panel discussion this Friday (2/3/12) at 8pm EST.&nbsp; </span>It would be great if some MotA fans would show up. The panel will be online at <a name=\"\" classname=\"\" class=\"\" href=\"http://webreef.net/\" target=\"_blank\">http://webreef.net</a><a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"%20http://webreef.net\"> </a><br><br>I hope to see you there! Virtually, anyway.<br><br>---<br><a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"%20http://webreef.net\"></a><br>When I sat down and worked out the storyline for the first chapter of Mysteries of the Arcana I had certain goals in mind. They were, in no particular order:<br><br>1. Establish the personalities of the main characters. Originally, this was just Theresa and Chrys but, as I wrote further, William's personality also became important.<br><br>2. Establish the existence of a group of secondary characters. Circe. Mandrake. Blue. Kludge. Melody. BbuzZ and the Surgeon were last minute additions to the roster.<br><br>3. Establish Theresa and Chrys's attraction to each other. The romantic element of the story was always important. In hindsight, though, I could have not hit people over the head so hard with it. I've taken some flak for their instant attraction.<br><br>4. Establish the basic elements of the setting. The arcana multiverse is a pretty complex one. I had to explain the existence of different arcana, the tarot connection, the existence of keys and their powers, the existence of the royal road and how it was used, and the existence of dreamwalkers. Originally, I wrote had Kludge give a very long speech. I'm talking pages of nothing but text. In writing it out, I managed to move things around and trim things down. I believe that the two pages of explanation Kludge gives Theresa followed by the lesson in using the royal road she gets from William later does a better job. There are still some questions unanswered but most of those will be explored in the next storyline.<br><br>5. Add some adventure, some action, some enticing plotline, and some funny. <br><br>What do you think? Did I succeed? Did you enjoy the first storyline? If so, what was your favorite bit?",
  "replies": [
    {
      "author": "Fairportfan*Guest*",
      "date": "01-31-2012",
      "text": "Ya know, i kinda like this unshaded version..."
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "01-31-2012",
      "text": "Well that was all very interesting and yes, the first chapter did a fine job of outlining the setting ^^"
    },
    {
      "author": "Felix Pleșoianu*Guest*",
      "date": "02-03-2012",
      "text": "I'm re-reading the first part now. It's not quite the way I remember it, especially the art. But it does do an excellent job of introducing the setting. And my favorite part is still Theresa waking up at the inn."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "02-03-2012",
      "text": "Concerning point 3, I really don't think so. Sometimes people just click, I'm in a relationship that happened sort of like Theresa and Chrys. Listen to 'I know you're out there somewhere' by The Moody Blues and you'll start to get an idea of what it's like. I see a lot of myself personality wise in Theresa even though I wasn't raised Christian or have family who was in the military. My parents were, I was not; I follow a more spiritual path because I was drawn to it, a part of that is because of my own ablities. My 18th was mere days before the 9/11 attacks, having ones own gift show the possiblity of war was something that took me _years_ to get over. I still don't talk about it much but I can now if I need to."
    },
    {
      "author": "JGray",
      "date": "02-03-2012",
      "text": "Felix, I have to wonder, how DID you remember chapter 1?"
    },
    {
      "author": "Felix Pleșoianu*Guest*",
      "date": "02-06-2012",
      "text": ""
    }
  ]
}