{
  "title": "Questions!",
  "author": "JGray",
  "date": "03-01-2012",
  "text": "Welcome to the intermission! We'll running a Q&amp;A, answering questions that readers have sent my way. The art was provided by the talented Tiffany Munro, creator of the brilliant and digitally painted webcomic, <a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"http://betweenplaces.spiderforest.com/\">Between Places</a>.<br><br>There will be ten pages of the Q&amp;A. One on March 1st and 2nd (Thursday and Friday), five the next week (March 5th-9th), and then finally, three more the week after (March 12th-14th). The comic will resume with Chapter 4 the next day, Thursday, March 15th. The next chapter will be an origin story, explaining what the arcana are and where they came from, how the Royal Road was created, and what makes a Key a Key.<br><br>I'm only going to be doing one blog entry for the entire ten page series. So, all comments for the Question series should be attached to this one. If you have follow-up questions based on the answers given in the comic, I'll do my best to answer them in the comments section.",
  "replies": [
    {
      "author": "Jasae Buhase*Guest*",
      "date": "03-01-2012",
      "text": "Pfffffft woooow~ that sums it up fairly well XD \n<br>thankies for answering that XD"
    },
    {
      "author": "Jasae Buhase*Guest*",
      "date": "03-02-2012",
      "text": "wooo~ awesome question XD"
    },
    {
      "author": "thedutchdevil*Guest*",
      "date": "03-05-2012",
      "text": "got&nbsp;a question:which fairytale character did chrys play?i'm thinking little red riding hood but i'm not sure"
    },
    {
      "author": "JGray",
      "date": "03-05-2012",
      "text": "Chrys isn't saying. Very nice icon, dutchdevil! COFFEE!"
    },
    {
      "author": "Seth*Guest*",
      "date": "03-06-2012",
      "text": "I notice that the Ace of Cups is listed on both the current page and the previous, with two different descriptions. &nbsp;Is that a mistake?"
    },
    {
      "author": "Jasae Buhase*Guest*",
      "date": "03-06-2012",
      "text": "Wow i totally didnt notice that~! XD \n<br>yay~ all that water from chapter 2 is goo people~ 8D"
    },
    {
      "author": "JGray",
      "date": "03-06-2012",
      "text": "My bad, yes. Blue is from the Page of Cups. I'll try to get that corrected."
    },
    {
      "author": "Gillsing*Guest*",
      "date": "03-06-2012",
      "text": "There also seems to be a tiny, unimportant typo in the second paragraph of the second page of Arcana descriptions: \"awsome\" instead of \"awesome\" (just in case it'll ever matter to anyone)"
    },
    {
      "author": "JGray",
      "date": "03-06-2012",
      "text": "Thanks for pointing out the errors, folks! We've corrected them."
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "03-09-2012",
      "text": "wooo~! yay for bbuzz~!"
    }
  ]
}