{
  "title": "Fashion!",
  "author": "JGray",
  "date": "03-30-2012",
  "text": "Well, Theresa putting on lip gloss didn't attract a lot of commenting. Mandrake looking cute in a new outfit didn't attract of commenting. If Theresa in a dress doesn't generate some comments? I'm gonna cry. <br><br>More seriously, Genn and I are paying a lot of attention to fashion this particular storyline. Everyone's in a new outfit and we're doing big reveals for each of them. Mandrake was first. Theresa is second. Wait till you see Chrys!<br><br>Hope you enjoy it!",
  "replies": [
    {
      "author": "adamas*Guest*",
      "date": "03-30-2012",
      "text": "Never pictures Theresa outside her tanktop and fatigue shorts...interesting"
    },
    {
      "author": "Hollis*Guest*",
      "date": "03-30-2012",
      "text": "Figures... Theresa is all dolled up and gorgeous, and Chrys is late.<br><br><br>Not a date, my ass!"
    },
    {
      "author": "rachel",
      "date": "03-30-2012",
      "text": "Definitely a date. Gorgeous, really. And I do like the attention to fashion! I guess I'll never escape that."
    },
    {
      "author": "Gillsing*Guest*",
      "date": "03-30-2012",
      "text": "If it's a date, why is Mandrake there? As a chaperon? Or as a \"not a date\" alibi? Or are they all just going to the same party?"
    },
    {
      "author": "TC*Guest*",
      "date": "03-30-2012",
      "text": "I would not be surprised if Chrys is in a tux."
    },
    {
      "author": "haggis25*Guest*",
      "date": "03-31-2012",
      "text": "I already love how this \"Not-Date\" is shaping up. <br><br>Her muscles seem more noticeable then normal, but that might just be the contrast between her muscles and the dress. Not a bad thing really, just a bit of curveball when you first see it."
    },
    {
      "author": "pseudo*Guest*",
      "date": "04-01-2012",
      "text": "She cleans up OK."
    },
    {
      "author": "rss*Guest*",
      "date": "04-02-2012",
      "text": "I look for updates via rss feed. The rss feed was frozen at Awkward Silence I, about 2 months ago. It appears to be back."
    },
    {
      "author": "Doku*Guest*",
      "date": "04-03-2012",
      "text": "Theresa...in a dress. Well, that just about settles it. We're at the end times. Joking, joking, of course. Must admit, the look was different, but in a good way."
    }
  ]
}