{
  "title": "Sorry sorry",
  "author": "JGray",
  "date": "04-19-2012",
  "text": "Sorry, folks. One of the realities of running a webcomic is that the artist's job is never full time. There are often many things more pressing and, quite frankly, more important for the continued survival and happiness of the creative team. In other words, sometimes life gets in the way of the comic. This was one of those weeks. I'm sorry we're only doing one comic this week instead of two.<br><br>As today's page reveals, this chapter is going to give you guys a LOT of information. You'll learn about the origin of the arcana, why keys ARE keys, and a little bit more about who the dreamers are. In addition, you'll learn more about the Royal Road. <br><br>Don't forget, we're running a contest. The details are in the last journal entry but they basics are that we're asking for fan art (drawings, poetry, stories, animations, cosplay photos... whatever bit of creativity tickles your fancy) and the top three that capture the spirit of the comic, as judged by me and Genn, will get a special prototype Mysteries of the Arcana tarot card! So far, we have no entries. I hope to get at least three by the deadline, which is mid-May.<br><br>See you next week!",
  "replies": [
    {
      "author": "Fairportfan*Guest*",
      "date": "04-20-2012",
      "text": "Panel 3 - just subtle enough on the blush."
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "04-20-2012",
      "text": "The origin of the arcana: my theory\n<br>\n<br>Once upon a time there was a smorgasboard of delicous pastries from croisants to eclairs to cupcakes and so forth. Then they decided the multiverse needed to be more awesome so they invented keys using kiwi filling and the arcana were made with apricot and the royal road was actually made by a sentient vat of rocky road ice cream thus creating the multiverse~\n<br>oh and dreamers are all elves that live inside an oak tree baking cookies thus making them awesome ^^ however they were driven to near extinction when kellogg company captured em all so the cookies could be mass produced for a larger market~\n<br>\n<br>-\n<br>and if even a tenth of that is accurate i shall be amazed XD \n<br>but anyways, woo~ this soundss like it will be an informative chapter ^^"
    },
    {
      "author": "Ayshara*Guest*",
      "date": "04-20-2012",
      "text": "Bushae: XD"
    }
  ]
}