{
  "title": "More explaining",
  "author": "JGray",
  "date": "04-27-2012",
  "text": "Here's another of those things I've been meaning to explain pretty much since day one. I meant to explain it in chapter one but there never seemed to be a good point. In chapter two it didn't make much sense. In chapter three there wasn't an optimal time. Finally, though, I found a spot where it doesn't interrupt the flow of the storyline.<br><br>So far, I've gotten only two entries for the contest. I'd like more! Let me emphasis that you don't need to draw to enter the contest. We'll accept any creative tribute to the comic be it poetry, prose, photograph, sewing, flower arrangement, or cooking recipe! Be creative and please enter!",
  "replies": [
    {
      "author": "Jasae Bushae*Guest*",
      "date": "04-27-2012",
      "text": "umm....*raises hand* what does Mandrakes normal emoticons look like then?"
    },
    {
      "author": "Nobody*Guest*",
      "date": "04-27-2012",
      "text": "I need that spell! I can't get most of what Mandrake says!"
    },
    {
      "author": "Gillsing*Guest*",
      "date": "04-28-2012",
      "text": "Mandrake's untranslated/default emoticons probably look like obscure cybernet memes from The Moon.<img src=\" //smilies/smile.gif \" border=\"0\" alt=\" Smile \" hspace=\"2\" vspace=\"2\">"
    },
    {
      "author": "JGray",
      "date": "04-28-2012",
      "text": "Mandrake's speech icons depend upon cultural context. For example, in our culture, a woman in a white dress might represent a bride. In Mandrake's culture, brides don't wear white dresses. Instead, their wings are magically changed to a silver color for the ceremony. So, if Mandrake were speaking about a woman getting married, she would project an image of a silver wing but Theresa would see a woman in a white dress."
    },
    {
      "author": "adamas*Guest*",
      "date": "04-29-2012",
      "text": "One way to say it would be if an elf, a dwarf and an orc were to have an argument, each would hear the entire thing in their own language."
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "04-29-2012",
      "text": "aaaah, so similar but with cultural significence changing some of the icons ^^ \n<br>\n<br>so would that mean the smiley face icon and other cultural similar thingies that cross boundaries would be more or less similar?"
    },
    {
      "author": "JGray",
      "date": "04-29-2012",
      "text": "Smileys cross cultural boundries on earth. They might not do so between arcana. That being said, Mandrake smiles a lot so..."
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "04-29-2012",
      "text": "i bet mandrakes world is fun and a half XD"
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "04-30-2012",
      "text": "More and more like the TARDIS."
    },
    {
      "author": "JGray",
      "date": "04-30-2012",
      "text": "More lesbian elves.<br><br>Less timey-wimey-wibbly-wobbly stuff.<br><br>More tarot symbolism.<br><br>Less Amy Pond flirting with herself."
    }
  ]
}