{
  "title": "Wow, huh?",
  "author": "JGray",
  "date": "05-04-2012",
  "text": "Much like a movie being formatted for standard definition television, this page has been edited to fit the viewing area. <a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"http://mysteriesofthearcana.com/templates/main/images/305full.jpg\">For a look at the FULL page, click here.</a><br><br>I asked Gennifer to put together a splash page showing off most of the cast so far (and then some!) and boy did she deliver! Every arcana explorer we've featured so far is making an appearance except for Chrys's dad and Mandrake, who has to watch the Inn during the Telling.<br><br>Beyond that, Gennifer put in a number of cameos and unique characters. One of the characters on this page will be very, very important to the next chapter. <br><br>Can you name all the MotA characters? Have any guesses about the extras? Care to wager which character is giving you an advanced preview of next chapter?<br><br>Next week, the Telling begins in earnest.",
  "replies": [
    {
      "author": "rachel",
      "date": "05-04-2012",
      "text": "Gennifer, this is amazing! So many really neat characters I can't wait to learn more about! And having the little turtle there, and Buzzz, and Blue, the others, is just awesome! The Pinnochio, the goldfish, TV-head, and the mysterious woman who seems to be in chaftan and hijab mostly hidden by the bonfire's flare and our perspective, all characters I can't wait to learn more about. The fact that the Grey conman is there is going to prove interesting, I am sure.\n<br>\n<br>I hope Mandrake can watch the Telling with the security cameras while she's 'on duty' at the Inn?"
    },
    {
      "author": "*Guest*",
      "date": "05-04-2012",
      "text": ":D&nbsp; Thank you so much, Rachel!&nbsp; I had a lot of fun with it.&nbsp; Making up new characters was a blast.&nbsp; And the cameos were neat, too."
    },
    {
      "author": "Pseudo*Guest*",
      "date": "05-05-2012",
      "text": ""
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "05-05-2012",
      "text": "Lets see...going through the characters from top left and down...\n<br>no idea who top left is \n<br>or the fishie....\n<br>bbuzz apparently got a new plant ^^\n<br>no idea about the guy with popeye tatoos...\n<br>no idea on the next person over though she has an AWESOME design X3\n<br>no clue on shakspeare but it has a super distinct design\n<br>the alien fellow kinda reminds me of the main from 'trying human'\n<br>another fun episode of bluues clues on the end of the top row\n<br>\n<br>second row left has curious tv head guy whose arcana of origin is something im curious about XD (anthromorphic tv? robot? guy with a screen helmet?)\n<br>the wooden boy looks very familiar but im drawing a blank...\n<br>also in the dark on purple pants pirate...\n<br>the dragon i recognize from an earlier chapter where he was playing poker with the invisible man\n<br>drawing a blank on the banshee fella between the dragon and the invisible man...\n<br>\n<br>the bottom row left person sorta reminds me of jenny everywhere...\n<br>then kludge\n<br>circe\n<br>william\n<br>world turtley thingy\n<br>and surgeon\n<br>\n<br>annnd im gonna guess the one in the hood is melody XD"
    },
    {
      "author": "Ayshara*Guest*",
      "date": "05-05-2012",
      "text": "I wouldn't say the guy between the dragon and invisible man's a Bean Sidhe, they are tradionally female, my money is on vampire instead. He's pale enough..."
    },
    {
      "author": "*Guest*",
      "date": "05-05-2012",
      "text": "Dream of the Endless... is that you? :-]"
    },
    {
      "author": "*Guest*",
      "date": "05-06-2012",
      "text": "Is it just me or does the bottom left look like a Dominic Deegan cameo."
    },
    {
      "author": "motub*Guest*",
      "date": "05-07-2012",
      "text": ""
    }
  ]
}