{
  "title": "The Telling Begins!",
  "author": "JGray",
  "date": "05-08-2012",
  "text": "Melody certainly does enjoy a bit of drama in her story beginnings, hmm?<br><br>Just a bit of trivia for these last few pages. Not only is this Gennifer's first full storyline, this is the first time she has drawn many of these characters. Kludge, Circe, Blue, and Surgeon... they're all new for her.<br><br>Now, for a roll call on the last page! In the <a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"http://mysteriesofthearcana.com/templates/main/images/305full.jpg\">full version</a>, one of you was clever enough to spot <a name=\"\" target=\"_blank\" classname=\"\" class=\"\" href=\"http://theshifterarchive.com/whois/\">Jenny Everywhere</a>. She's sitting there in the first row on the far left side. Kludge and Circe, of course. William's there as is BbuzZ. BbuzZ does, indeed, have a new utility plant. Blue and Surgeon are there. Since they were told it was a special event, Blue insisted that it and Surgeon wear ties. As today's page shows, Melody's the gal in the white robe.<br><br>The invisible guy in the trenchcoat is named Parker. He's a detective who ran afoul of a mad scientist. The serpent necked individual in the space suit is Captain Nowlan, a retired military woman and privateer. <br><br>As for the rest? The pale skinned individual DOES look an awful lot like Dream of the Endless, doesn't he? The grey in the tuxedo is not someone we have encountered before (he is neither the mini-grey thief or Uncle Mork, the used ship salesman) but he is from the same arcana as those characters. None of the other characters are named yet, except for the red themed woman with the headphones. She, I promise, you will see again.",
  "replies": [
    {
      "author": "adamas*Guest*",
      "date": "05-08-2012",
      "text": "you forgot the little turtle didn't ya? :P"
    },
    {
      "author": "JGray",
      "date": "05-08-2012",
      "text": "I did indeed. The turtle was here as the representative of the Knower of Truths."
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "05-08-2012",
      "text": "oooh~ so thats its name ^^ yay knower of truths~\n<br>\n<br>\n<br>and were the other seven unamed charries cameo appearances, nameless background characters or left unnamed because nobody figured out where they are from? ^^;"
    },
    {
      "author": "Pseudo*Guest*",
      "date": "05-08-2012",
      "text": "I can see Blue and Surgeon getting together.&nbsp; Both have an academic intrest in biology, and are immortal.&nbsp; Jenny is the perpetual outsider, but here she is among her peers.&nbsp; Perhaps she knows something about about whatever is hunting dreamwalkers?"
    },
    {
      "author": "Jasae Bushae*Guest*",
      "date": "05-09-2012",
      "text": "darn, i could swear ive seen some of those mysterious faces in the audience somewhere and went to the trouble of power reading the arcana but no luck ^^; \n<br>\n<br>\n<br>oh and a side question~ will we be seeing more of captain nowlan and parker? they sound like they have interesting stories :3"
    }
  ]
}