{
  "title": "Damn...",
  "author": "JGray",
  "date": "05-18-2012",
  "text": "\"Hey, Genn! For the next page, I'm going to send you designs for eight new characters. I'll need you to reproduce my rambling but very detailed ideas for these designs with precision but still add some artistic flair to the whole mess. Can you do that in a few days?\"<br><br>Damn, can she! Ladies, gentlemen, those who are both, and those who are neither, may I introduce to you the Kings and Queens of the Minor Arcana. Cups. Swords. Pentacles/Coins. Staffs/Rods. With this page, we witness the birth of the Minor Arcana in Mysteries of the Arcana lore. <br><br>I cannot express enough how delighted I am with the way Gennifer's art has brought my ideas to life. Better yet, how she added to those ideas and made the Kings and Queens truly something special. <br><br>Thanks, Genn. So much.<br><br>P.S. There are a great many little, symbolic details hidden in each of the Kings and Queens. Can you find them?",
  "replies": [
    {
      "author": "rachel",
      "date": "05-18-2012",
      "text": "There's not much I can say to improve on what J said. But Genn, I wanted to add my own praise: These pages have been AWESOME, and this page is EVEN BETTER! Way to go!"
    },
    {
      "author": "Gillsing*Guest*",
      "date": "05-18-2012",
      "text": "I see the four colours/symbols of regular playing cards. And the four alchemical elements, of course."
    },
    {
      "author": "Ketira*Guest*",
      "date": "05-18-2012",
      "text": "<font face=\"Verdana\" size=\"2\">Of course I do - I've done my own study of the Tarot. &nbsp;Each Minor Arcana is also associated with an Element - although the author of the deck I use (The Witch's Tarot) put Air with Wands &amp; Fire with Swords. &nbsp;But for most decks, what you have there is what is accepted. &nbsp;I also interpret the Arcana along those lines:</font>"
    },
    {
      "author": "Ayshara*Guest*",
      "date": "05-19-2012",
      "text": "Ketira, I have the Celtic Tree deck and the Arthurian one, both follow the same rules. TBH, I couldn't think of it any other way and it is odd to see swords represented by air."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "05-19-2012",
      "text": "Addendum: It's also odd to have Spirit represented by Fire, Fire and Light works as both are close but Spirit is closer to Air..."
    },
    {
      "author": "Ayshara*Guest*",
      "date": "05-19-2012",
      "text": "to me, the order should be:<br><br>Air - Spirit<br>Fire - Emotion (and light)<br>Earth - Matter<br>Water - Psyche"
    },
    {
      "author": "Erik*Guest*",
      "date": "05-20-2012",
      "text": "Odd, no one mentioned the materials of the thrones yet?<br>Gold and Silver with Matter/Earth/Pentacles/Diamonds<br>Smoke/Steam and Ash? with Psyche/Air/Swords/Spades<br>Glass and Obsidian? with Spirit/Fire/Rods/Clubs<br>Shell and I think Corral or something with Emotion/Water/Cups/Hearts<br><br>I also like that the objects representing the suits of the arcana also have the symbol of the arcana on them."
    },
    {
      "author": "sidhe3141*Guest*",
      "date": "05-21-2012",
      "text": "Maybe it's just the deck I'm using, but I have a Queen of Wands with a slightly different pose (left hand down, holding a flower; rather than raised and cupping a... spark? flame? star?)<br>Each also has a king corresponding to the appropriate state of matter (pentacles=solid, cups=liquid, swords=gas, wands=plasma), but all of the queens look like they're alive in the conventional sense. The tendency of the queens to mean more compassionate things, maybe?<br>I also count 56 (14*4) people in the first panel.<br><br>As far as what was associated with which element, I'm getting \"spirit as the driving force, emotion as the restraining one; and matter and psyche representing the difference between mind and body\", but I agree, that sounds kind of forced."
    }
  ]
}