{
  "title": "Update #3",
  "author": "JGray",
  "date": "12-08-2013",
  "text": "Here we are, three pages into our return! Is it just me? Or is the above page the most disturbingly erotic one we've ever posted? Those are some very naughty bubbles.&nbsp;<div><br></div><div>Let me take a moment, btw, to point you towards another awesome comic. <a href=\"http://supervillainous.spiderforest.com/\" class=\"\" classname=\"\" target=\"_blank\" name=\"\">Supervillainous</a> is about an evil mastermind who also happens to be a dad. How do you balance being evil and being a good father? The comic's adorable yet funny. Both well written and well drawn. I recommend it!</div><div><br></div><div>And finally, I ask... what should Chrys and Theresa get each other for Christmas? What do you think?</div>",
  "replies": [
    {
      "author": "Gunsolo*Guest*",
      "date": "12-09-2013",
      "text": "So... the bubbles are dreams, and they gave birth to a... planet? I'm a little confused.<br><br>The first gift idea that popped up in my head is a decorated gun holster for Theresa. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Musical_life*Guest*",
      "date": "12-09-2013",
      "text": "I am somewhat reminded of a preying mantis mixed with an amoeba, which is a disturbing thought too..."
    },
    {
      "author": "JGray",
      "date": "12-10-2013",
      "text": "Gunsolo, just what the bubbles have created will be clear on Thursday. This is one of those cases where the page isn't self contained."
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "12-12-2013",
      "text": "Matching orgasms"
    },
    {
      "author": "Tsuki_Ouji*Guest*",
      "date": "07-04-2015",
      "text": "It wouldn't be *too* hard to balance being an EVIL GENIOUS with being a good dad/father figure; in fact, the good ol' Evil Overlord List has several good suggestions. However, if you need to hide your identity.... Then things get hinky."
    }
  ]
}