{
  "title": "Up Early",
  "author": "JGray",
  "date": "12-18-2013",
  "text": "I'm enjoying being able to update the comic a few hours early each Monday and Thursday (or should I say Sunday or Wednesday).&nbsp;<div><br></div><div>Jasae Bushae guessed right on why the Minor Arcana can create worlds but the Major Arcana cannot. The Major Arcana, born from dreams, don't have the same connection to the basic building blocks of existence.</div><div><br></div><div>For those of you who are interested, I recently wrote an advice column for new webcomic creators called <a href=\"https://www.comic-rocket.com/news/2013/12/12/webcomic-truth-first-six-months/\" class=\"\" classname=\"\" target=\"_blank\" name=\"\">Webcomic Truth - the First Six Months</a>. It was posted over at <a href=\"https://www.comic-rocket.com/\" class=\"\" classname=\"\" target=\"_blank\" name=\"\">Comic Rocket</a>, a great site for reading webcomics. You can subscribe to Mysteries of the Arcana through Comic Rocket, btw, <a href=\"https://www.comic-rocket.com/explore/mysteries-of-the-arcana/\" class=\"\" classname=\"\" target=\"_blank\" name=\"\">by going to this page.</a></div><div><br></div><div>With that, I'll see everyone next Monday? What do you all think of the Fool, by the way? Don't forget, he's connected in some way to the Inn and the Royal Road that allows travel between the arcana!</div>",
  "replies": [
    {
      "author": "Jasae Bushae*Guest*",
      "date": "12-19-2013",
      "text": "Wow, so they did try mixing with the minor Arcana. Interesting...Though I suspect someething big will happen in the next page or two."
    },
    {
      "author": "eermine*Guest*",
      "date": "12-20-2013",
      "text": "I love the use of the stark white background."
    },
    {
      "author": "Ashlei*Guest*",
      "date": "12-21-2013",
      "text": "I actually follow JGray on twitter and he made mention of how precious reviews are to creators so here's my first of hopefully many. My only complaint is that the next panel isn't up so I can finish it but this is beautifully drawn and written. I also suspect something big is about to happen but I way more invested in the back story. See you next update =)"
    },
    {
      "author": "JGray",
      "date": "12-22-2013",
      "text": "Jasae, you might be right!"
    }
  ]
}