{
  "title": "Silver City!",
  "author": "JGray",
  "date": "12-29-2013",
  "text": "<p>Since we're closing out 2013, this seems as good a time as any to announce Silver City! Silver City, written by myself and Keith Wood and illustrated by Keith will be a twelve issue, print superhero comic exploring the setting of Silver City and the lives of a small group of heroes who find themselves with extraordinary powers (and the just as extraordinary consequences that come from those powers) in the Greek mythology obsessed Silver City.</p><p>The comic probably won't see print until the middle of 2014. As we move forward we'll keep MotA readers up to date on Silver City's progress. Hopefully when the comic is printed we'll see a few orders from our faithful Mystery of the Arcana readers!</p><p>Just a reminder, we're running a contest! The first four people to send me an email telling us the title of the page each quote said by Theresa and Chrys in our Kickstarter teaser trailer comes from will receive a prototype Theresa Devil tarot card. The contest is open to international readers.\nIn case you didn't see it, the <a href=\"http://youtu.be/ryxdm3KEw7c\" target=\"_blank\">video is here</a>. </p><p><strong>And the email address you send your entry to is mysteriesofthearcana (at) gmail (dot) com.</strong> </p><p>I've have exactly one card left to give out! I'd really like to mail all four. The deadline is 1/2/2014.</p><p>That's it. Thursday we'll be back with the next page of Mysteries of the Arcana. Happy New Year everyone!</p>",
  "replies": [
    {
      "author": "JD*Guest*",
      "date": "12-30-2013",
      "text": "That cover looks pretty awesome. You can sign me up for a first run edition for sure.<br>I'm not gonna try to identify sayings and titles, cuz I'm terrible at that. My memory for trivia (and just about everything else) is about as long as my... well, we won't mention that. Anyway<br>What was I talking about? Oh yeah, sign me up."
    },
    {
      "author": "Beekay006",
      "date": "12-30-2013",
      "text": "Happy New Year to both you and Keith!"
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "12-31-2013",
      "text": "Happy new year!"
    }
  ]
}