{
  "title": "66%",
  "author": "JGray",
  "date": "01-12-2014",
  "text": "<p>First, let me introduce you to the Corrupter. Let's just say Theresa knows him well and if anyone could figure out how to trap beings of immense power like the minor arcana, it is this entity. The poor King of Pentacles, stuck for eternity in the center of a world made of precious metals and gemstones.</p><p>As I am writing this the <a href=\"http://www.kickstarter.com/projects/355389852/mysteries-of-the-arcana-chapter-5/\" target=\"_blank\">Mysteries of the Arcana chapter 5 Kickstarter</a> has raised $2,713. That's 66% of our $4,100 goal in less than a week! I am so grateful to each person who has backed the campaign so far. Thank you for believing in Mysteries of the Arcana and in Keith and I. We can't do this without you.</p><p>I'd like to point out how awesome our $5 donation reward is. Plenty of comic-based Kickstarters place every backer's name on a wall somewhere on their website, thanking them for their donation. We will do that for everyone, of course, <strong>but </strong>we're doing something more, too. Every backer who donated $5 or more to the campaign will have their name hidden somewhere in the art of chapter 5. </p><p>So, a few months from now you might wake up, come to read the latest page of Mysteries of the Arcana, and spot your name hidden in the texture of the wall behind Theresa or perhaps hidden in the stitching of Mandrake's jacket!</p><p>How awesome is that?</p><p>I am serious when I say this. If every person who reads Mysteries of the Arcana regularly donates $5 to the <a href=\"http://www.kickstarter.com/projects/355389852/mysteries-of-the-arcana-chapter-5/\" target=\"_blank\">chapter 5 Kickstarter campaign</a> it will go a long, long way towards helping us make our goal. It might even put us over the top! So, please, if you can, head over to the campaign and back it.</p><p>We really want to hide a lot of names in chapter 5.</p><p>Thanks and see you Thursday!</p>",
  "replies": [
    {
      "author": "JD*Guest*",
      "date": "01-13-2014",
      "text": "I will definitely be there to back it, just as soon as I figure out how to pay for it. Will at least be more than $5. Sorry didn't get around sooner, been down with the flu. gak<br><img alt=\" Cry \" src=\" //smilies/sad5.gif \" border=\"0\" hspace=\"2\" vspace=\"2\">"
    },
    {
      "author": "Adamas*Guest*",
      "date": "01-13-2014",
      "text": "I'll have to see what I can shake loose so I'm not promising anything, but I'll see what I can do."
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "01-14-2014",
      "text": "I wonder if the Corrupter is the only one who can trap them like that, or if anyone of them can and he is just the one who figured out how to do it."
    },
    {
      "author": "JGray",
      "date": "01-14-2014",
      "text": "JD, Adamas, we welcome whatever support you can give us. Not that JD doesn't support us mightily already with our hosting and code support!"
    }
  ]
}