{
  "title": "Filler.",
  "author": "JGray",
  "date": "02-12-2014",
  "text": "<p>I'm afraid Keith has gotten hit by a one two punch. First illness and then the ice storm that is crippling much of the south. End result is he couldn't finish up today's page in time. I apologize to everyone for the interruption. We'll post the next page of Mysteries of the Arcana as soon as possible.</p><p>In the meanwhile, Blair B of <a href=\"http://www.starcrossd.net/\" target=\"_blank\">Star Cross'd Destiny</a> has sent us this epic, amazing pinup of bad-ass Chrys to use as filler. I am freaking impressed. You can check out her comic, of course, or <a href=\"https://www.kickstarter.com/projects/absinthejunk/star-crossd-destiny-volume-2-printing\" target=\"_blank\">her Kickstarter</a> which has a ton of cool rewards both from her comic and her alt rock band.</p><p>Also, please remember that during our hiatus we'll be running Webcomic Trailers! Got a webcomic, game, or indy book you want to promote? Create a one page \"trailer\" poster for it telling MotA readers why they should read/play your work. These are like movie trailers for indy web projects (except, you know, a single image instead of a video) so make it compelling! We'll be posting up to thirteen trailers so first come, first serve. The trailers need to be 650x1054 and 72dpi, saved in JPG format and sent to mysteriesofthearcana (at) gmail (dot) com by March 3rd.</p><p>See you soon!</p>",
  "replies": [
    {
      "author": "the leaking pen*Guest*",
      "date": "02-12-2014",
      "text": "Hope you feel better Keith!&nbsp; Not sure where I commented a couple months ago that I was going to read this comic finally got around to catching up! Love the story so far, can't wait to see where it goes.&nbsp;"
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "02-13-2014",
      "text": "\"I will now rip your head off ... and then I will pour a large-economy-size can of 300-proof Grade-A whupass down your neck...\""
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "02-13-2014",
      "text": "Wow, that is seriously bad-ass. <br>Reminds me a little of Zintiel from Flaky Pastry (probably because of the grin). Now I have a whole new archive to go through this weekend. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\"><br><br>I hope Keith gets well soon.<br><br>Also, Filler:<br>http://www.youtube.com/watch?v=ToSDArwatEQ"
    },
    {
      "author": "JGray",
      "date": "02-14-2014",
      "text": "Leaking Pen, welcome! Thank you for reading through the archives. We're glad to have you with us."
    }
  ]
}