{
  "title": "30",
  "author": "JGray",
  "date": "02-19-2014",
  "text": "<p>If today's update looks familiar to you it might be because it bears a striking similarity to<a href=\"http://mysteriesofthearcana.com/comics/398/\" target=\"_blank\"> this one</a>. Some of you may have noticed that, as a comic writer, I am a bit fan of symmetry. Perhaps I am a little OCD there but I believe symmetry and carefully applied asymmetry can be very useful storytelling tools.</p><p>This is the end of the Telling, I believe, but not the end of the chapter. There's a few more pages before we're through. Stick with us. I think you'll like what you read.</p><p>I'd like to take a moment to point out two Kickstarters I'm supporting. Both are for print volumes of webcomics I read and both are excellent. Neither has reached goal yet, though they are both close.</p><p>The first is <a href=\"https://www.kickstarter.com/projects/absinthejunk/star-crossd-destiny-volume-2-printing\" target=\"_blank\">Star Cross'd Destiny volume 2</a>. Go back a few pages in our archive and you might recognize the style. Blair, the artist of Star Cross'd Destiny, draws badass like nobody's business. Plus, the comic's got more authentic cajun than Gambit from the X-Men. Which isn't hard, I admit, but still awesome.</p><p>The second is <a href=\"https://www.kickstarter.com/projects/delphina/sombulus-book-1-a-fantasy-adventure-comic\" target=\"_blank\">Sombulus, Book 1</a>. Like Mysteries of the Arcana, Sombulus takes place in a multiverse with wildly varying universes. Unlike MotA, the art style changes from universe to universe, really drawing out the unique flavor of each setting. </p><p>Give both comics a try and, if you have the funds, consider backing their Kickstarters. They both really deserve to hit their goals. You know I believe that because I put my money where my mouth is and backed each one.</p><p>See you Monday!</p>",
  "replies": [
    {
      "author": "Fairportfan*Guest*",
      "date": "02-20-2014",
      "text": "Did people move around during The Telling? &nbsp;Because Theresa sits down on Chrys's left at the beginning ... but she's on her right at the end."
    },
    {
      "author": "verias",
      "date": "02-20-2014",
      "text": "As I told J, I think William kept elbowing her so she moved."
    },
    {
      "author": "PSEUDO*Guest*",
      "date": "02-24-2014",
      "text": "Is it just me, or is there something weird about her face in panel 5?"
    }
  ]
}