{
  "title": "Coming Up on the End",
  "author": "JGray",
  "date": "03-02-2014",
  "text": "<p>And with today's page we're just one away from the end of chapter 4. Ironically, it is the shortest chapter we've told in terms of page count but it has taken the longest to tell due to the hiatus.</p><p>Since we're close to the end of chapter 4, this seems as good a time as any to tell you about an upcoming project I hope to debut starting in April: Golden Dames. There's a lot of great comics out there in the public domain. Mostly stuff from the golden age of comics (the 30s, 40s, and 50s) and from publishers who didn't survive to the modern day (either the way Marvel and DC did or through being gobbled up by one of the big two). As a result, the stories of a lot of amazing female characters have been lost to the edges of geekdom. I plan on changing that. Golden Dames will come at you three days a week, digitally printing female positive, public domain comic stories in webcomic form. In other words, Golden Dames will operate just like any other webcomic only with previously created material instead of new stuff. In addition, I'll be providing commentary on the titles, characters, creators, and companies that produced the stories. Sort of like bonus features on a DVD. My hope is by sharing my love of comic history with you folks I'll inspire a few minds and bring some worthy ladies back into the spotlight.</p><p>Don't worry, though. We're still hard at work on chapter 5 of Mysteries of the Arcana. We've set a date of March 24th for that. </p><p>See you on Thursday for the finale of chapter 4!</p>",
  "replies": [
    {
      "author": "Adamas*Guest*",
      "date": "03-03-2014",
      "text": "I might try the food if it doesn't do like Wonka's Meal in a Gum."
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "03-03-2014",
      "text": "Liquid meals... so it's a bar? <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Musical_life*Guest*",
      "date": "03-03-2014",
      "text": "Gunsolo, it wouldn't surprise me if that was the case. I prefer a liquid meal on top of solid ones now and again. :D Though, I've been having more liquid then normal because of hard times."
    }
  ]
}