{
  "title": "Still Delayed",
  "author": "verias",
  "date": "04-14-2014",
  "text": "<p>Hey everyone, Keith here.</p><p>So, to put everyone's mind somewhat at ease, I'm alright. That being said, life is not without its perils and interruptions. There is a medical ordeal going on right now, and it's played havoc with my schedule this past week.</p><p>Tomorrow we will be visiting the doctor, and hopefully getting some way to manage things until surgery time. I won't go into much more detail than that, in order to protect privacy, but as it is going on in my home, it does impact me quite a lot.</p><p>In the meantime, enjoy another DC inspired cosplay with the ladies. I actually had the Powergirl joke popping around my head for a bit, and it's fun to get to put it up here, for you guys to see.</p><p>So, Power Girl and Huntress, MotA cosplay style.</p><p>Things should be back on track for Thursday to resume our regularly scheduled Chapter 5.</p><p>Regards,</p><p>Keith W.</p>",
  "replies": [
    {
      "author": "Fairportfan*Guest*",
      "date": "04-14-2014",
      "text": "There was a bit in the <em>Birds of Prey</em> comic. &nbsp;It opens with Black Canary riding her bike to meet some Bad Guy who wants to talk but will only talk to her.For regular readers, this was a bit ... surprising ... as they'd just wound up a long continuity in which Dinah had gotten both legs broken.As she rides, she's talking to someone on her BoP comm earrings.It's when she says \"...and the fishnets are ridiculous.\" and her interlocutor says \"Fishnets or no fishnets, at least no-one can tell if I'm an inny or an outie\" that we realise that this is Huntress disguised as Black Canary."
    },
    {
      "author": "David*Guest*",
      "date": "04-14-2014",
      "text": "Hey Keith. Hope it is not too serious a condition.<br><br>Going through a similar situation at my end, so I know how you feel, mate. Just stay calm and positive."
    },
    {
      "author": "Adamas*Guest*",
      "date": "04-14-2014",
      "text": "SURGERY?! *Faints*<br><br>Seriously though. Hope it all works out man.<br><br>(Always prefered Huntress to PG, BTW It's the crossbows.)"
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "04-14-2014",
      "text": "Hope it goes well, just be sure to get plenty of rest.<br><br>Theresa doesn't seem too happy about her costume there."
    }
  ]
}