{
  "title": "Theeee Barooooon!!!",
  "author": "verias",
  "date": "04-21-2014",
  "text": "<p><strong>Hidden Names: </strong>CeciliaY</p><hr><p>So, hope everyone out there had a good weekend, holiday or otherwise.</p><p>Since we started, MotA has always had little nods to pop culture sprinkled throughout the comic. I find some of these to be just silly fun to do, like last Thursday's page. It wasn't in the script to make the flash-bang a Thermal Detonator, but I decided \"What the hay.\" and just ran with it.</p><p>What's everyone else's opinion on seeing those little pop culture references, and perhaps a few you might like to see down the line (we may not use them, but superb ideas might get jotted down by J or myself.</p><p>Enjoy the page!</p><p>Keith W.</p>",
  "replies": [
    {
      "author": "Adamas*Guest*",
      "date": "04-21-2014",
      "text": "I like the references. As for one I'd like to se...how about a Sonic Screwdriver-looking tool being used as..I don't know...a SCREWDRIVER? <img src=\"//smilies/wink1.gif\" alt=\"Wink\" border=\"0\">"
    },
    {
      "author": "TC*Guest*",
      "date": "04-21-2014",
      "text": "I love em, they are one of the things that make MotA stand out, not many comics with a serious and legitimate on going story line like you guys have drop pop culture references like you guys do, and they always make me laugh and enjoy the pages a bit more. So in my book keep em up!"
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "04-21-2014",
      "text": "The references can be a lot of fun, but too many of them can change the tone of the comic.<br><br>Lockdown? The inn has more security measures than I expected.<br>Seems like an awful lot of work just to tap into their wifi. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Musical_life*Guest*",
      "date": "04-23-2014",
      "text": "True, Gunsolo, It's a balancing act but one I'm enjoying seeing. As for references, how about a robot horse? (A nod to the Warlock series)"
    },
    {
      "author": "Alex*Guest*",
      "date": "04-24-2014",
      "text": "\"The Baron\" bears a distinct resemblance to the first Doctor played by William Hartnell, but with a moustache and monocle.."
    },
    {
      "author": "Zixinus*Guest*",
      "date": "04-30-2014",
      "text": "Who is the Eddie the Lightbringer? A google search gives confusing results."
    }
  ]
}