{
  "title": "ComicsFix and RPGs",
  "author": "JGray",
  "date": "02-18-2015",
  "text": "<p>I love this page, don't you? I was inspired by more recent work on Hawkeye and Young Avengers - the use of motion and composition to tell a story of continued movement in a single page. Keith took my idea and executed it brilliantly. Theresa and Kludge are very dynamic here.</p><p>Two items of news this week. </p><p>First, chapters 1 and 2 (and their bonus stories, Narrow and Fly Away Home) are available via <a href=\"https://comicsfix.com/\" target=\"_blank\">ComicsFix</a> now. ComicsFix is sort of like Netflix for comics. You pay $9 a month and get access to hundreds of comics to read. There's stuff from Dynamite like the Shadow, Vampirella, Voltron and Army of Darkness. There's stuff from Valiant like X-O Manowar and Shadowman. There's Lilith Dark and Beowulf. And a lot of webcomic stuff, too! </p><p>If you have a ComicsFix subscription or are getting one, please give Mysteries of the Arcana a read there. We get paid per page view.</p><p>In other news, I am now a line editor for Flaming Crab Games. We are developing a monthly series of short, Pathfinder-compatible books called \"From the Logbooks of the Flaming Crab\". Each month we'll be focusing on a different topic. We're recruiting now for the first three topics: Winged Cavalry, Cooking Magic and Pagan Holidays. We're not looking for pitches on material - we've got each installment outlined. Instead, you apply to be a writer and, if you're hired, we give you an assignment with instructions on content and format (though there is still room for creativity within that framework). <a href=\"http://paizo.com/threads/rzs2rxfh&amp;page=2?ThirdParty-Publishers-Freelancer-Open-Call#64\" target=\"_blank\">Details are here!</a> If you're interested, consider applying. This is a paying gig.</p><p>Bricks of the Arcana will go up Friday and I'll be posting a new MotA and blog entry next Wednesday! See you then. </p>",
  "replies": [
    {
      "author": "Lukkai*Guest*",
      "date": "02-18-2015",
      "text": "\"It's what you just nearly fell into.\" is what comes to mind as an answer to that last panel. (^_^)"
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "02-19-2015",
      "text": "Careful, you don't want to fall into that bottomless pitch-black gap in the world. Those things are infested with grues. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\"><br><br>I see that Theresa's hair has gotten considerably longer. How long was the timeskip, a few months?"
    },
    {
      "author": "Musical_life*Guest*",
      "date": "02-20-2015",
      "text": "The Fool, home of the Void. Watch out for the Grues, they can be gruesome. :P"
    }
  ]
}