{
  "title": "Walk Through the Woods",
  "author": "JGray",
  "date": "08-20-2015",
  "text": "<p>There's nothing quite like a snow-covered walk through the woods, holding hands.</p><p>Even if those woods weren't there to begin with.</p><p>So, obviously, I'm back from Florida. My family and I went to a couple of different locations. We visited LEGOLand, the Wizarding World of Harry Potter, a lovely little historical preservation of pre/early Industrial Florida buildings, and Downtown Disney.</p><p>LEGOLand: Everything really was awesome. The LEGO models, especially miniland, were awe-inspiring. On our first day we had the VIP package so we got first seating on any rides, a host who took care of all our needs, anything we ate was included, kids automatically won the carnival game they played, the kids got to open the park, a giftbags full of neat stuff like beach towels and model kits. So, amazing. </p><p>On the second day they let my daughter meet all five of the LEGO Friends (they have actors playing the parts throughout the park) one on one in a princess dress they gave her. She had a blast. We also went to the waterpark and had a fun time there. </p><p>Wizarding World of Harry Potter: Gorgeous and straight out of the movie. Except for so many tourists you couldn't move or breathe. In the shops I felt like I was about to be rammed into every time I turned around. The Leaky Cauldron had very good food, though, and the butterbeer was tasty. Essentially cream soda with a marshmellow topping. The Hogwarts Express was a delightful bit of storytelling trickery. I suspect I'd like the whole thing more in the middle of winter when I could slow down and enjoy the atmosphere.</p><p>Downtown Disney: A big mall. Yep. But a nice one. I was sad at the lack of Black Widow specific t-shirts in the superhero store.</p><p>And that's what I did during my summer vacation. How about you?</p>",
  "replies": [
    {
      "author": "Fairportfan*Guest*",
      "date": "08-20-2015",
      "text": "Hmmm.Looks like Chrys has chased Theresa long enough that Theresa finally caught her."
    },
    {
      "author": "Sario528*Guest*",
      "date": "08-21-2015",
      "text": "Ok, panel 2 is just too awesome."
    },
    {
      "author": "Lukkai*Guest*",
      "date": "08-21-2015",
      "text": "No big summer vacation for me. Instead I will go in autumn for two weeks to...<br>*inhales*<br>JAPAN!<br>Which will be totally awesome, I'm sure."
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "08-24-2015",
      "text": "Ya know - the pocket detailing on Chrys and Theresa's coats is sorta ... ummm ..."
    }
  ]
}