{
  "title": "Return of Bricks of the Arcana",
  "author": "JGray",
  "date": "08-24-2015",
  "text": "<p>So, some good news and some bad news.</p><p>The good news is we're planning on starting up Bricks of the Arcana again. We're in a comfortable place where we can do that.</p><p>The bad news is that, for now, Bricks of the Arcana will be a patreon exclusive. Which means that people who are donating to the Patreon, no matter at what level, will get to see Bricks of the Arcana four times a month. Regular visitors to the site won't. </p><p>I hate doing this but that is the way the webcomic economy works, currently. We survive on the Patreon and there needs to be something to reward those people who help keep the comic going.</p><p>---</p><p>In other news, the comic is going to get a whole lot more... interesting over the next couple of weeks.</p>",
  "replies": [
    {
      "author": "Adamas*Guest*",
      "date": "08-24-2015",
      "text": "Damn, oh well I fear my discretionary funds are pretty much tapped for the forseeable future anyway (my comp just finished it's long,slow,lingering death and needed to be replaced).<br><br>As for the comic...yeah from snow to Venus's Garden of Love...something smells odd and I don't mean the pheromones the girls are giving off!"
    },
    {
      "author": "Peaches*Guest*",
      "date": "08-25-2015",
      "text": "Theresa sure takes a lot of convincing. Just go with the flow, girl."
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "08-25-2015",
      "text": "Or is that supposed to be Chrys's head - what looks like sidewhiskers being her hair?Tempting fruits in the form of symbolic representations of each one's object of affection - the pistol representing Theresa for Chrys and the elf-head representing Chrys for Theresa?"
    },
    {
      "author": "JGray",
      "date": "08-25-2015",
      "text": "I'm loving the speculation, everyone. Keep it up. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Lukkai*Guest*",
      "date": "08-26-2015",
      "text": "I'm quite with Theresa on this one, truth be told. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\"><br><br>Wait: Is that a gun on the left?!<br>Last edited by Guest<br>Edited 1 time(s)."
    }
  ]
}