{
  "title": "Actually...",
  "author": "JGray",
  "date": "09-14-2015",
  "text": "<p>As much as I love me some Fallout, war does change, quite a bit. If it didn't, we'd still be lining up our soldiers and overlapping shields with our spears pointed out, wouldn't we? Mass produced firearms changed things and then trench warfare changed things yet again. As did the invention of mobile armored devices, nuclear weapons, and tactical insurgencies. What's going on in the Middle East today looks nothing like WW2 and WW2 is worlds away from the American Revolution.</p><p>We're back on schedule this week. Monday and Thursday.</p><p>Anyone out there a Sentinels of the Multiverse player? I picked up the iOS version on my iPad for my birthday and am loving it. Strife keeps kicking my butt, though. I have no idea how that guy is only challenge rating 2!</p><p>See you Thursday!</p>",
  "replies": [
    {
      "author": "Fairportfan*Guest*",
      "date": "09-14-2015",
      "text": "I understand why Theresa wears a glove that leaves her trigger finger free - but why does Chrys?"
    },
    {
      "author": "Kessy Athena*Guest*",
      "date": "09-16-2015",
      "text": "The tools of war may change, but war itself really doesn't.&nbsp; A generation of young men hacked to death by swords is not fundamentally different from a generation blown apart by roadside bombs.&nbsp; War is and always has been among the most terrible and traumatic things in human experience.&nbsp; The only thing that's really changed is scale.&nbsp; Our ability to wage war has become great enough to destroy our entire world.&nbsp; Which is why we can't keep doing it anymore.<br><br>Incidentally, insurgencies are really one of the oldest forms of warfare.&nbsp; What the US faced in Iraq is very similar to what it faced in Vietnam a generation ago.&nbsp; Or, for that matter, what the Romans faced in conquering Britain two millennia ago."
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "09-17-2015",
      "text": "\"The tools of war may change, but war itself really doesn't.\"==================Two vultures were sitting in a tree, waiting for something to die, when they suddenly saw a whole host of animals running toward them - big animals, small animals, predators and prey, all running in a panic and not paying any attention to each other.Finally one of them called down to a bear who was passing a little more slowly than the rest, looking back over his shoulder occasionally.\"Hey, man - what's going on? &nbsp;It looks like you're all running from a fire, but I don't see any fire...\"\"No,\" the bear said. &nbsp;\"The humans are having another war, and everybody's scared, so we're all running away until it's over.\"&nbsp;\"Huh,\" the other vulture said, \"for hundreds of thousands of years, we vultures have been doing quite well for ourselves out of the human wars. &nbsp;All sorts of goodies lying around, you know.\"\"Well, good luck, then,\" the bear said and trotted off.The vultures nodded to one another, took wing, and flew back in the direction the animals had been coming from ... and were vapourised in a twenty megaton nuclear blast.And the moral is, things can change in a hundred thousand years."
    },
    {
      "author": "Kessy Athena*Guest*",
      "date": "09-17-2015",
      "text": "If your family is killed in a war, does it really matter if they were killed with spears or with a nuclear bomb?&nbsp; If your town is destroyed, does it really matter if it was burned by Mongol raiders or flattened by supersonic bombers?<br><br>War is death.&nbsp; War is destruction.&nbsp; War is loss and suffering and pain.&nbsp; War is severed dreams and the work of generations laid waste in an instant.&nbsp; that is as true today as it was the first time two bands of hunter gatherers came to blows over a hunting kill.<br><br>Like I said, the difference is the scale.&nbsp; At the Battle of Agincourt in 1415, 6,000 - 9,000 English troops met 12,000 - 36,000 French and 7,000 - 10,000 died.&nbsp; At the Battle of Kursk in 1943, 940,900 Germans faced 2,500,000 Soviets, and something like 450,000 died.&nbsp; Even nuclear weapons (although admittedly they suck for the vultures) are mainly a question of scale.&nbsp; A thousand conventional bombs can destroy a city.&nbsp; A thousand fusion bombs can destroy the world."
    }
  ]
}