{
  "title": "LEGO Dimensions",
  "author": "JGray",
  "date": "10-01-2015",
  "text": "<p>My family was kind enough to pre-order LEGO Dimensions for me for my birthday. Last weekend I picked up the starter set, the Back to the Future level expansion, and the Portal 2 level expansion. I've also got the Doctor Who level expansion on pre-order but that doesn't come out until November.</p><p>So, far, I'm having a blast. Building the portal (you physically build a LEGO model to go on the toy reception pad) was fantastic. It is easily one of my favorite builds ever. It looks great! Gandalf, Wildstyle, Batman, Chell from Portal, and Marty McFly are all excellent minifigures. And they are actual minifigures that will work with any LEGO set. The each come with a stand that transmits data to the reception pad, letting the game know which minifigures are present.</p><p>I was surprised to find out that the starter set didn't come with paper instructions for building the Batmobile (the game uses vehicles as well). Instead, you build the Batmobile when Batman builds the Batmobile in-game, with the instructions up on the screen.</p><p>The attention to detail is amazing! For example, Gandalf and Batman bend their arms at the elbows and legs at the knees, just like they do in their own games. Wildstyle, on the other hand, only moves like an actual minifigure would because that's how all the characters in the LEGO Movie move (remember the scene with Emmet doing \"jumping jacks\"?). The soundtrack and visuals change from level to level. In the Simpsons level, for example, the colors are all bright and there's no much in the way of shading - just like in the show.</p><p>And the voice acting? First rate. They took pains to bring in original actors whenever possible, even for smaller roles. Robin, for instance, is voiced by Scott Menville from the Teen Titans animated show. Doc Brown and Marty McFly from Back to the Future are voiced by Christopher Lloyd and Michael J. Fox, respectively. The amazing Clancy Brown is Lex Luthor. Peter Capaldi plays the 12th Doctor. I'm pretty sure they got the current voice cast for Scooby Doo and for the LEGO Movie to all reprise their roles. In some cases, they use archive audio for actors, such as in the case of the Simpsons and Doctors 1 through 11 (yes, you can play EVERY Doctor in the game - except the War Doctor).</p><p>J.K Simmons plays Cave Johnson. Ellen McClain plays GladOS. I'm told GladOS sings a new song for LEGO Dimensions.</p><p>All in all, despite being a money suck (it is a collectible game after all) it is a gorgeous and fun game and I can't recommend it enough. Think about this...</p><p>You can have the Doctor and Doc Brown travel around together.</p><p>Is your mind blown?</p><p>Oh! Hey, look. There's a new comic up today. How about that? Hope you like it! </p><p>See you Monday!</p>",
  "replies": [
    {
      "author": "Gunsolo*Guest*",
      "date": "10-02-2015",
      "text": "The Doctor and Doc Brown time traveling together!?<br>Great Scott, that's heavy! <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Musical_life*Guest*",
      "date": "10-05-2015",
      "text": "I want this for that reason."
    }
  ]
}