{
  "title": "Keith Streams!",
  "author": "JGray",
  "date": "10-19-2015",
  "text": "<p>Morning, folks!</p><p>There was some more discussion after last week's page about gun safety and the rifle the viquirrels are using. A guess was made as to which real world model we used to... er... model our gun after. I'm not going to confirm or deny the guess just yet. It is actually a plot point of sorts.</p><p>In other news! Keith is now streaming the digital part of his art process regularly! And he invites y'all to wander in and watch him work, ask him questions, and enjoy the atmosphere.</p><p>Keith has two channels in which he shows his work. The first channel is specific to Mysteries of the Arcana and <a href=\"http://www.picarto.tv/MysteriesoftheArcana\" target=\"_blank\">can be found here</a>. It is SFW and you can get a preview of the upcoming pages of the comic as they are made.</p><p>The second channel is for all his other art, including commission work and, therefore, not always NSFW. You can <a href=\"http://www.picarto.com/veriasarts\" target=\"_blank\">find it here</a>.</p><p>Keith is obviously not streaming all the time. That would be tiring. Follow him on twitter (handle: @verias) and you'll get announcements via twitter as to when streaming is starting up. I'll do my best to retweet those and I know DaveB over at GrrlPower does a well.</p><p>Alright! See you Thursday!</p>",
  "replies": [
    {
      "author": "Adamas*Guest*",
      "date": "10-19-2015",
      "text": "Ok, that guy is creeping me out even more."
    },
    {
      "author": "Lukkai*Guest*",
      "date": "10-19-2015",
      "text": "And now I'm wondering about the reliability of those guns."
    },
    {
      "author": "Lukkai*Guest*",
      "date": "10-19-2015",
      "text": "Oh, and I think the second link you gave is wrong. Might wanna have a look at that."
    },
    {
      "author": "TheDerangedOne*Guest*",
      "date": "10-20-2015",
      "text": "Yep, Mr. Mist is a text book* Creepy slimeball arms dealer. Definitely is pushing this conflict to go on long and heavy to profit out of it."
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "10-22-2015",
      "text": "Ummm ... not to sound like some sort of word-use fascist, but i THINK the word you want is \"depredations\" not \"deprivations\" (though i do see that the dictionary does list \"the act of depriving\" as a definition there); \"depredations\" are acts of robbing, stealing, etc - that is preying on as \"depredations upon sheep by coyotes\", which sounds more like what Smilin' Jack probably means.\"Depriving\" someone of something can take many forms - including legal seizure, while \"depredation\" pretty much implies violence or force of arms."
    }
  ]
}