{
  "title": "Pushing the Patreon",
  "author": "JGray",
  "date": "12-10-2015",
  "text": "<p>Man, Mister Eeerie <a href=\"http://mysteriesofthearcana.com/comics/610/\" target=\"_blank\">sure sounds familiar</a>, doesn't he? I'm sure he's helping the red viquirrels out of the goodness of his own heart. Assuming he has one and not just a laminated button with a heart painted on it or something. Hmmm. What do you think?</p><p>In other news...</p><p>Gentlebeings who support Mysteries of the Arcana, I bring you glad tidings! As of this morning, the <a href=\"https://www.patreon.com/user?u=452395&amp;ty=h&amp;u=452395\" target=\"_blank\">Mysteries of the Arcana patreon</a> has reached not only its fourth but its fifth milestone! What does this mean?</p><p>1. It means that I, J Gray, start paying myself for writing the comic. Thanks to the generosity of our patrons I now make a grand total of $5 per comic! It doesn't seem like much but I can't tell you how thrilled I am to actually be making something off the comic. It has been a long time coming.</p><p>2. More important, Keith gets a raise! He will now be getting an additional $30 per month. That still doesn't come close to compensating him for what his talents are worth but it is a step in the right direction.</p><p>Because we've reached milestone 5, I've gone ahead and added milestone 6. If the Patreon funding hits a total of $450 a month we will produce <strong>TWO BONUS STORIES PER YEAR</strong>. These bonus stories will be shared with Patreon backers first but will eventually be available to all Mysteries of the Arcana fans. The bonus stories will be 5 to 8 pages in length, illustrated in full color, and will be canon. </p><p>So, all in all? A very exciting day. I'm quite happy.</p><p>See you Monday!</p>",
  "replies": [
    {
      "author": "Gunsolo*Guest*",
      "date": "12-13-2015",
      "text": "Congratulations on reaching those milestones! <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Lukkai*Guest*",
      "date": "12-13-2015",
      "text": "Woot, woot! :D"
    }
  ]
}