{
  "title": "The New Year Continues!",
  "author": "JGray",
  "date": "01-11-2016",
  "text": "<p>Somehow, 2016 keeps going no matter how many times I write '2015' instead of '2016' when filling in the date on forms, checks, and other things I fill in dates on. I consider that rude.</p><p>So... I'm playing Fallout 4. I've restarted twice now. The third attempt at 'Tag' seems to be the one I like. Whenever I have a choice to name my character I always either pick the default (for example, my main character in Persona 4 Golden is always Yu Narukami) or I pick the name 'Tag Onist'. See what I did there? Add a 'pro' in front and you get...</p><p>... that's why I'm clever enough to write this webcomic.</p><p>Anyway, because Fallout 4 is much more a shooter than the previous versions, I'm having a tougher time of it. I always prefer intelligent, charismatic characters over super combat characters. Of course, I also pumped up my perception enough to get some good lockpicking in. And I raised my endurance enough to grab hold of the breathe underwater because I'm sure it will open up new areas and, hey, I can always go underwater as an escape route when the super mutants are charging after me, ready to eat my spleen.</p><p>I've only just now reached Diamond City. I'm going slow, taking my time and exploring because, hey! Just because I'm looking for my lost baby doesn't mean I can't get to know what's around me. I want to be sure I bring my kid back to a good home, right? </p><p>What games are you playing?</p><p>See you Thursday!</p>",
  "replies": [
    {
      "author": "*Guest*",
      "date": "01-11-2016",
      "text": "But they'll all die before we do, and then we win!"
    },
    {
      "author": "Adamas*Guest*",
      "date": "01-12-2016",
      "text": "I'm STILL on Fallout 4. And while it's possible it is VERY hard to play a minmaxed charecter. The random spawns can catch ya in some bad spots. Just got killed because I Fast Traveled to the Super Duper Mart and got caught litterally between a Behemoth and that !^^$#*!^(*%^#**&amp;^ing raider behind the billboard with a Fat Man (And by between I mean the area loads, the behemoth hits me half a second before the mini-nuke does. I HATE Lexington!) <img src=\"//smilies/razz.gif\" alt=\"Razz\" border=\"0\">"
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "01-12-2016",
      "text": "I've been playing a bit of StarCraft and Hearthstone recently, and I'm really looking forward to XCOM 2. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "verias",
      "date": "01-12-2016",
      "text": "Skyrim, here. Finally got it on the Steam Winter Sale and it's been fun thus far."
    },
    {
      "author": "JD",
      "date": "01-13-2016",
      "text": "World of Warcraft.&nbsp; It's my addiction, because I can choose the content that doesn't overload my aspie mind like pretty much every shooter does. Plus it's constantly evolving... and gnomes rock.<br><br>Oh, and sometimes tanks. WoT is just cool. <img alt=\" Snoopy \" src=\" //smilies/snoopy.gif \" border=\"0\" hspace=\"2\" vspace=\"2\">"
    }
  ]
}