{
  "title": "Squirrel Titles",
  "author": "JGray",
  "date": "01-21-2016",
  "text": "<p>You can tell Keith named this page because I would have gone with \"the Forest for the Squirrels\" or \"the Squirrels for the Trees\" or possibly some odd hybrid like \"The Forquirrels for the Squirees\". Yeah. The last one. I would have gone with the last one.</p><p>I'm sorry about Monday being AWOL. There were some family emergencies that needed to be dealt with. I'm not going to say all is better now but life does move on.</p><p>Now! For actual commentary on the comic!</p><p>Each chapter, I try to challenge myself as a writer by picking specific techniques to work with. Last chapter, for example, I spent a lot of time on pacing. My goal was to try to speed it up, get the action flowing, and cut out the fluff. Not easy on a webcomic that updates twice a week but we can't all be David Willis now, can we?</p><p>This chapter I've been experimenting with reinforcement of themes using reoccuring images and phrases. Hopefully I'm not overusing it but there's a point to Isc and End being essentially the same. Mister Eerie and Mister Mist being similar. The repeated use of phrases. I'm trying to say something here!</p><p>I hope some of you are hearing it.</p><p>See you Monday!</p>",
  "replies": [
    {
      "author": "Peaches*Guest*",
      "date": "01-22-2016",
      "text": "Aside from Mist-Eerie I am completely lost and confused. <img alt=\" Confused \" src=\" //smilies/confused4.gif \" border=\"0\" vspace=\"2\" hspace=\"2\">&nbsp;It's ok, that's my normal state."
    },
    {
      "author": "TheDerangedOne*Guest*",
      "date": "01-23-2016",
      "text": "Ah, yes, but who made the forest this way now, I wonder. *eyes the two button heads who are now talking in perfect sync.* I doubt these squirrels have enough hatred to come to anything more than mild heat of flickering embers to actually make this happen on their own. Someone seems to have added fuel and accelerant to them to make a roaring fire."
    },
    {
      "author": "David*Guest*",
      "date": "01-23-2016",
      "text": "Considering that the trees are gone, resources are scarce, and now two mysterious figures are encouraging war and even arming each side with weapons...<br><br>Nope, nothing suss going on here at all <img alt=\" Rolleyes \" src=\" //smilies/rolleyes.gif \" hspace=\"2\" border=\"0\" vspace=\"2\">"
    }
  ]
}