{
  "title": "Your Favorite MotA?",
  "author": "JGray",
  "date": "02-11-2016",
  "text": "<p>Hello! So, here I am, starting to work on chapter seven of Mysteries of the Arcana. Seven! My goodness. And I decided to ask a question I hope y'all will answer. Well, four questions really.</p><p>What's your favorite chapter of Mysteries of the Arcana?</p><p>And why?</p><p>What's your least favorite?</p><p>And why?</p><p>As a reminder, here are the chapters.</p><p>Chapter 1: More Heavens and Earths - Theresa meets Chrys and they end up having an adventure in the Devil where they rescue Chrys's mom. </p><p>Chapter 2: All the Way Down - Chrys and Theresa travel to an arcana of giant turtles, where truths are revealed.</p><p>Chapter 3: Two by Two - Everyone has to \"pay their rent\" by going supply shopping. William and Theresa visit his home arcana while Chrys and Mandrake end up chasing a little thief in a 1950-ish science fiction setting.</p><p>Chapter 4: In the Beginnings - Chrys and Theresa have their first \"date\", listening to Melody tell the origin story of the arcana.</p><p>Chapter 5: Inn Trouble - Baron Sir and a band of mercs invade the Inn. </p><p>Chapter 6: Void in the Road - This chapter!</p><p>I would really appreciate it if everyone who reads the comic took the time to answer these questions. Your thoughts will be a great help in writing the next chapter.</p><p>See you Monday!</p>",
  "replies": [
    {
      "author": "Aleena*Guest*",
      "date": "02-11-2016",
      "text": "<font size=\"2\">Chapter 4 is my favorite. It brought forward pretty essential information about what the multitude arcana actually is. I like the world building aspects of the comic in general, and I like the progression of Chrys and Theresa's relationship in specific.</font>Last edited by Guest<br>Edited 8 time(s)."
    },
    {
      "author": "Laura*Guest*",
      "date": "02-11-2016",
      "text": "Heyoh,"
    },
    {
      "author": "Aleena*Guest*",
      "date": "02-11-2016",
      "text": "<font size=\"2\"></font>Last edited by Guest<br>Edited 2 time(s)."
    },
    {
      "author": "KFox*Guest*",
      "date": "02-11-2016",
      "text": "My least favourite is chapter 4. I still like it, but up until then, MotA was much more action-orientated, and was so for the other two chapters. I felt it broke the flow of the story.<br><br>My favourite is a toss-up between chapters 1, 5, and 6. I really like buff guys like William and Eke, so any chapter which features them prominently will rank high for me. Story-wise, chapter 1 gets everything rolling and is easy to understand, chapter 5 shows just how much the keys work as a team and form a strong bond, and 6 focuses a lot more on the relationships between the keys and their friends."
    },
    {
      "author": "fairportfan*Guest*",
      "date": "02-11-2016",
      "text": "I suppose my favourite chapter is Chapter 2 - which explains why a Catholic girl like Theresa had no hesitation about suicide, even though suicide automatically damns your soul. &nbsp;She was sure she was already damned.Chapter 5 is my least favourite - i felt as if it was dragged out too long and was a little too plot- rather than chatacter-driven."
    },
    {
      "author": "Dave Robinson*Guest*",
      "date": "02-11-2016",
      "text": "My least favorite was Chapter 4. It broke up the story too much for me, and I found it difficult to follow because I had no real character investment in it.<br><br>My favorite is Chapter 1. It introduced the characters in a way that made me care about them and their relationship."
    },
    {
      "author": "JD*Guest*",
      "date": "02-11-2016",
      "text": "I don't know, I've enjoyed them all pretty much. If I have to choose a favorite, I guess chapter 3 due to the varied action (if I recall correctly, my mind wanders a bit). Least favorite? Meh, not a chapter at all, just that time when you were on hiatus."
    },
    {
      "author": "Adamas*Guest*",
      "date": "02-11-2016",
      "text": "Chapter 3 is my favorite for the simple reason that Chrys finally figured out that she was doing the exact same thing that her father did and almost lost her oldest friend in the process. That and Mandrake's my favorite character (She's just so SQUEEE!)"
    },
    {
      "author": "six*Guest*",
      "date": "02-12-2016",
      "text": "Sorry but I just can't manage to decide a favorite and least favorite chapter.What makes one good is linked to what happens in previous and sometimes future chapters.&nbsp;Love the comic so just keep doing what you are doing!"
    }
  ]
}