{
  "title": "War, Huh! Good God Y'all...",
  "author": "JGray",
  "date": "02-18-2016",
  "text": "<p>And so, the master plan is revealed! Remember Quest's cache? That's why Chrys and Theresa came to the Hanged Man in the first place. It seems they aren't the only ones interested in it...</p><p>Before I go further, I want to once again point out the <a href=\"https://www.kickstarter.com/projects/1456806822/letters-from-the-flaming-crab-2016-for-the-pathfin\" target=\"_blank\">Letters from the Flaming Crab Kickstarter</a>. The goal is to raise $2,500 in order to produce twelve books (one a month) for the Pathfinder RPG on a variety of topics, including strange weather (rains of toads, anyone?), county faires (corn dogs and fireworks!), tiny dragons (available now to a good home!), and hygiene (sure, you plundered a dungeon but do you think anyone's going to want to buy treasure from you until you wash the goblin guts out of your teeth?). This whole thing's kind of a big deal for me, folks. This is my first time being in charge of my own line of books that I'm not publishing myself. I really want to see it succeed so, please, consider donating. For my readers outside the US, be aware the books are PDFs and not in print, so there's no worry about shipping problems. We're currently about $1,100 short of our goal with 13 days left. Its looking risky.</p><p>Speaking of readers outside of the US! Gunsolo asked what my favorite and least favorite chapters of Mysteries of the Arcana are. You know what? I can't decide. I wrote them all, after all, so maybe I'm too close. So, instead, here's a brief summary of my thoughts on each.</p><p>Chapter 1: I'm still pretty damn proud of this chapter. In hindsight, I do wonder if I should have taken the time to build up the attraction between Chrys and Theresa more but, at the same time, I believe getting it out of the way made sense. This comic isn't about 'if' they fall in love or even 'how' but, rather, the difficulties of their relationship. I'm also proud of how much information I packed into the chapter without making it one long bought of exposition.</p><p>Chapter 2: Chapter 2 wasn't supposed to happen originally but the serial distribution methods of webcomics made me realize it could take years to reveal Theresa's big secret if I didn't hit on it right away. I like to think I packed an emotional punch there and experimented with some new techniques, telling the story in pictures without words first and then in words without pictures later. My one regret is I didn't follow up on Chrys's living cloak. I still need to do that.</p><p>Chapter 3: This chapter was just fun! After breaking Chrys and Theresa apart I needed to give them reasons to get back together. So they BOTH had to recognize their flaws and decide to overcome them. I like to think I did that without being too preachy. Plus, the giant ants, miniature greys, parrot space pirates, and plastic yuppie zombies were just a blast to create.</p><p>Chapter 4: This one seems to be either a love it or hate it chapter for many readers and I understand why. Originally, it was supposed to be a side comic but I just couldn't afford it at the time. I felt the information presented was needed before going forward with the main plot about the baleful eyes. Of course, it didn't help that I burned out and it took way too long to tell as a result. Thank Keith for talking me back to my senses, folks! Still, I won't lie. I love every panel of this chapter. I'm biased, but I think I created a mythological origin story that takes the symbolism of the tarot and turns it into something new. I'm proud of that.</p><p>Chapter 5: As has been noted, chapter five was light on character development and heavy on the action. Which is on purpose. I went into writing the chapter wanting to do an action movie storyline - a reverse heist film if you will. Fast, witty, and fun. I added some nice angst for Theresa, I think, and pushed her and Chrys a little further down the relationship road. Plus, everyone had a moment to shine. On the other hand, I do wish I had included a little more development for Chrys, Mandrake, and William beyond just giving them badass action moments.</p><p>Chapter 6: This chapter reads better, I believe, as a whole than it does in serial format. I realize in writing it that I've stopped trying to force a \"conclusion\" panel on every page, as is common in webcomics, and so it flows better from page to page. I was aiming for a touch of Alice in Wonderland weirdness gone wrong with the viquirrels and the triple sign post and I like to think I achieved that. More importantly (though you're only now starting to see it), this chapter moves both Chrys and Theresa along their relationship path AND advances the main storyline of the comic.</p><p>Okay, that's all! Again, please consider backing the <a href=\"https://www.kickstarter.com/projects/1456806822/letters-from-the-flaming-crab-2016-for-the-pathfin\" target=\"_blank\">Letters from the Flaming Crab Kickstarter</a>. It really is important to me or I wouldn't keep begging. See you Monday!</p>",
  "replies": [
    {
      "author": "Kay*Guest*",
      "date": "02-18-2016",
      "text": "Hey,<br><br>I totally love the comic. I read it in one batch a few weeks ago, when they were just meeting the first pinhead guy (was that mister eerie?). So I won't give my favorite chapter, as the first few felt very fast for me and now it's to a much slower pace so it's hard to compare.<br><br>What I actually wanted to ask is why Kickstarter is used for all backing these days. They still only support credit cards, which can be hard for some of us europeans. There are enough alternative sites that support other payment options too these days."
    },
    {
      "author": "TheDerangedOne*Guest*",
      "date": "02-18-2016",
      "text": "... Yeah, trench warefare is a pretty sound way to \"accidentally\" find such things. Terrible, yeah, but still quite sound.&nbsp;Last edited by Guest<br>Edited 1 time(s)."
    },
    {
      "author": "fairportfan*Guest*",
      "date": "02-19-2016",
      "text": "Someone(s) want their ass(es) kicked.Or shot."
    },
    {
      "author": "Peaches*Guest*",
      "date": "02-19-2016",
      "text": "Mutt? Mutt!?!"
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "02-19-2016",
      "text": "But how did they know about the cache?<br><br>Also, mutt??<br>This is going to end painfully. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Adamas*Guest*",
      "date": "02-20-2016",
      "text": "\"MUTT?! Yousa gonna die SLOOOW!\""
    }
  ]
}