{
  "title": "Oh, THERE you are, Theresa!",
  "author": "JGray",
  "date": "02-29-2016",
  "text": "<p>See, Theresa? You brought that gun for a reason. Because you knew, in your heart of hearts, that a giant amalgam melty button headed arms dealer would backhand your girlfriend into a tree after giving her a haircut.</p><p>I mean, who DIDN'T see that coming? Am I right? </p><p>What do you think? Should Chrys just shave it all off and rock the GI Jane look?</p><p>See you Thursday!</p>",
  "replies": [
    {
      "author": "mythtress*Guest*",
      "date": "02-29-2016",
      "text": "Where do you shoot a button-headed creature that comes apart and is still talking with half of one of its faces melted?&nbsp; Devil power, don't fail her now!"
    },
    {
      "author": "six*Guest*",
      "date": "02-29-2016",
      "text": "Sure hope she keeps some hair and didn't break anything important from such a hit."
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "02-29-2016",
      "text": "Hah! So it <i>was</i> a face-melting laser.<br><br>I doubt she'll shave it all off, but maybe she'll sport a mohawk?"
    },
    {
      "author": "Musicalife*Guest*",
      "date": "02-29-2016",
      "text": "Chrys' best option would be to cut her hair, even though she'd look odd without her long hair."
    },
    {
      "author": "Kringles*Guest*",
      "date": "02-29-2016",
      "text": "I don't know, the newly cut (torn) hair looks great already. It's not everyday that we see a villain give one of our protagonists a \"haircut\" without it looking terrible."
    },
    {
      "author": "Lukkai*Guest*",
      "date": "02-29-2016",
      "text": "Let's give it another page or two for us to admire her new haircut before deciding on any drastic measures, why don't we.<br><br>What I've seen so far, she might absolutely rock that look!"
    },
    {
      "author": "Bmanmax*Guest*",
      "date": "03-01-2016",
      "text": "Janus smiley scares me."
    },
    {
      "author": "fairportfan*Guest*",
      "date": "03-01-2016",
      "text": "<a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/BerserkButton\">Berserk Button</a>"
    }
  ]
}