{
  "title": "Things are Shiny",
  "author": "JGray",
  "date": "03-17-2016",
  "text": "<p>Ack! Sorry this is later than normal. Today's just been a bunch of little distractions, one after the other. I totally forgot that it was Thursday and I needed to post the comic.</p><p>So, who is playing what lately? I've been wanting to pick up the new Fire Emblem and I'm sort of excited about Grand Kingdom. And then Valkyria Chronicles Remastered is coming out soon and Persona 5 and...</p><p>... man, way too many excellent games coming out!</p>",
  "replies": [
    {
      "author": "Laura*Guest*",
      "date": "03-17-2016",
      "text": "jgray, awesome page. Story is getting loaded with all the feels.&nbsp;"
    },
    {
      "author": "fairportfan*Guest*",
      "date": "03-17-2016",
      "text": "The short hair and that form-fitting shirt (or whatever) are a really good look for Chrys.<br>Of course, she must be wearing an incredibly-thin but rigid  bra  under it"
    },
    {
      "author": "Lukkai*Guest*",
      "date": "03-19-2016",
      "text": "Not playing a lot except for p&amp;p rpg's lately. There, it's a mostly mix of Exalted, Splittermond, Shadowrun, Through the Breach and a few homebrews."
    },
    {
      "author": "Kez*Guest*",
      "date": "03-19-2016",
      "text": "J, please respond to the email sent to you regarding SpiderForest membership by March 23rd. I will make one further attempt to contact you on that date."
    },
    {
      "author": "Gunsolo*Guest*",
      "date": "03-19-2016",
      "text": "Chrys is looking pretty good with short hair. Mr. Misteerie should look into getting a job as a barber. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\"><br><br>I don't really have much time to play games these days. I've been squeezing in the occasional Hearthstone match here and there but the last couple of weeks have been spent nearly entirely on <a name=\"\" target=\"\" classname=\"\" class=\"\" href=\"https://www.youtube.com/watch?v=9lCRyh-02EM\">this robot.</a> After my exams I will definitely be playing some XCOM 2, and probably trying out Arkham Knight."
    }
  ]
}