{
  "title": "Sorry Everyone!",
  "author": "verias",
  "date": "04-07-2016",
  "text": "<p>Page is incomplete, and things are still hectic for everyone around the MotA offices, so here's some flats to tide you over.</p><p>I will be finishing and updating the page tomorrow, so the final rendered page will be available then.</p><p>Also, two patreon cameos this page!</p><p>Aleena and Shawn Stephens!</p><p>Hope you guys can forgive me for now!</p><p>Regards,</p><p>Verias</p>",
  "replies": [
    {
      "author": "Aleena*Guest*",
      "date": "04-07-2016",
      "text": "I've always wanted to have some backstory with Quest.&nbsp;<span style=\"color: #212121; font-family: 'Slab Serif', sans-serif; line-height: 26.25px; background-color: #FFFFFF;\">Shawn Stephens must be that satyr statue.</span>Last edited by Guest<br>Edited 1 time(s)."
    },
    {
      "author": "fairportfan*Guest*",
      "date": "04-07-2016",
      "text": "Does it emit aphrodisiac pollen?"
    },
    {
      "author": "JD*Guest*",
      "date": "04-09-2016",
      "text": "Realistically, y'all probably didn't need to flag the comic with that little bit of boobage, but it's all good. Better safe than sorry, eh?<br><br>Interesting the things tucked away in this place of her father's.<br><br>So you know, I've released a grue into the system. This grue wanders the  dark corners of the network, and while like all grues he has a taste  for adventurers, he really likes to eat spammy posts. He likes to eat  posts with links in them, especially lists of links or those way back in  the archive. He does get to know the regulars though, and will let  commenters post a link or two without eating it up if he's seen them  around awhile.<br><br>Be wary of the grue. No need to feed him, he stays plenty fat eating spam.<br>Last edited by JD<br>Edited 1 time(s)."
    },
    {
      "author": "Lukkai*Guest*",
      "date": "04-10-2016",
      "text": "I don't think I'd ever trust a plant that clicks like that.<br><br>No really! You stay and see what it does, I'm gonna watch from a continent over."
    },
    {
      "author": "Brian*Guest*",
      "date": "04-14-2016",
      "text": "I was expecting the smile from Something Wicked This Way Comes."
    }
  ]
}