{
  "title": "Geez, Theresa...",
  "author": "JGray",
  "date": "05-09-2016",
  "text": "<p>Way to go, Theresa! Way to totally derail an important plot point and world background idea. All because you have to talk about how hot you find your girlfriend. You know you're supposed to be all nervous and not into her, right? </p><p>Some characters. Geez.</p><p>In other news, how many of you are into steampunk? <a href=\"https://bundleofholding.com/presents/CastleFalkenstein\" target=\"_blank\">Bundle of Holding has the entire line of one of the first (and best) steampunk RPGs, Castle Falkenstein</a>, available for $20! Part of the money goes to Reading is Fundamental, a great charity. So consider stopping over and picking the books up. Castle Falkenstein is one of my favorite RPGs of all time. I can't recommend it enough. And Comme il Faut, their guide to life in a magical steam age, is worth it for any steampunk play, even if its not that specific setting.</p><p>See you Thursday!</p>",
  "replies": [
    {
      "author": "Gunsolo*Guest*",
      "date": "05-09-2016",
      "text": "This needs testing. Quick, draw on some more bullets and fire them at other random things! See if they catch fire as well or turn into other things."
    },
    {
      "author": "Lukkai*Guest*",
      "date": "05-09-2016",
      "text": "Sheesh, that last panel! :D<br><br>Theresa's got a point though.<br><br>And I've got a hunch as to what they might get up to once back to the inn. And good cover up it would be, should they get back in time to not be caught returning by one of the others. <img src=\"//smilies/wink1.gif\" alt=\"Wink\" border=\"0\">"
    },
    {
      "author": "fairportfan*Guest*",
      "date": "05-09-2016",
      "text": "It is not a coincidence that lots of babies are born nine months after their parents survive stressful frightening life-threatening events..."
    },
    {
      "author": "Bob!*Guest*",
      "date": "05-12-2016",
      "text": "Theresa Urkel?"
    }
  ]
}