{
  "title": "Technical Issues",
  "author": "JGray",
  "date": "12-19-2016",
  "text": "<p>We tried something fancy! Look at that! Animation! Well, for those of you with a Flash plugin. It now occurs to me that some of you might not be seeing this, especially if you are reading the comic on a mobile device.</p><p>Also, the page isn't centering right. I suspect we still have some bugs to work out. If you are having trouble with today's page please leave us a comment so we can figure out how to fix it. </p><p>This is what I get for thinking something Shotgun Shuffle did was neat...</p>",
  "replies": [
    {
      "author": "Aleena*Guest*",
      "date": "12-19-2016",
      "text": "This page seems pretty ideal for an animated gif - limited colour palette; it could be expressed with few frames of animation. Fade-in probably wouldn't look as smooth though."
    },
    {
      "author": "adamas*Guest*",
      "date": "12-19-2016",
      "text": "Works fine for me, and I'm suddenly hearing \"Be our guest\" in my head..."
    },
    {
      "author": "JD*Guest*",
      "date": "12-20-2016",
      "text": "And more along the Beauty and Beast theme. Nice.<br><br>I'm using Firefox and it is displaying perfectly.&nbsp; It's a rather cool effect.<br><br>*edit*<br>Brought the page up in Chrome. Little symbol says Adobe Flash is out of date. I choose run anyway, and it displays perfectly. I update the flash plugin in Chrome and reload the page: the alignment is off a bit to the left.&nbsp; Seems to me it's the plugin's fault, not yours.<br>Last edited by Guest<br>Edited 1 time(s)."
    },
    {
      "author": "JD*Guest*",
      "date": "12-20-2016",
      "text": "And now, of course, Firefox is also displaying it a bit to the left. Either way, still looks good."
    },
    {
      "author": "Lurker57*Guest*",
      "date": "12-22-2016",
      "text": "Doesn't display at all on an iPad"
    },
    {
      "author": "PhoenixCodes*Guest*",
      "date": "03-01-2017",
      "text": "Yeah, I only ever read from my mobile... Wish you had added an alternate image, either static or otherwise animated, for those of us without flash.&nbsp;"
    }
  ]
}