{
  "title": "And We're Back!",
  "author": "verias",
  "date": "08-13-2018",
  "text": "<p>Sorry for the delay, guys. Some life stuff happened that drew me away for a bit, and took a large portion of my focus. </p><p>I do hope patience is paying off, now that we've seen the big reveal of our baddie. So! It seems perhaps, there's definitely more to this pawnbroker than initially visible. Now, the question is...what shall we see with William's predicament?</p>",
  "replies": [
    {
      "author": "Gunsolo*Guest*",
      "date": "08-13-2018",
      "text": "I hope William brought his sword. Then he can essentially flush that overgrown spider down the drain. <img src=\"//smilies/smile.gif\" alt=\"Smile\" border=\"0\">"
    },
    {
      "author": "Adamas*Guest*",
      "date": "08-14-2018",
      "text": "KILL IT! KILL IT WITH FIRE AND STEEL!"
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "08-18-2018",
      "text": "Wnder if the girls are just sorta keeping an eye on William..."
    },
    {
      "author": "cjack99*Guest*",
      "date": "09-10-2018",
      "text": "Wow, this story is moving along like.............. a snail crossing a football field, from goalpost to goalpost.&nbsp; snooooooooozzzzzzzzzzeeeeeeeeeeeeeee.&nbsp;"
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "10-03-2018",
      "text": "* cricket * cricket *"
    },
    {
      "author": "cjack99*Guest*",
      "date": "10-06-2018",
      "text": "Snail died about 2/3 way across the field.&nbsp; Sigh.&nbsp; I think it's time to stick a fork in this comic, pretty sure it's dead, along with the snail."
    },
    {
      "author": "Fairportfan*Guest*",
      "date": "10-14-2018",
      "text": "There was a long hiatus before and it came back.<br><br>OTOH, it HAS been a while."
    },
    {
      "author": "cjack99*Guest*",
      "date": "10-16-2018",
      "text": "Yeah, too bad, it started out very nicely, good story, good artwork, interesting premise.&nbsp; Then it seemed to hit a wall, bounced back a bit, but this latest arc has been like a dying grasp, and it feels like it has expired.&nbsp; Would like to know whats going on though, I've followed this for what seems like years.&nbsp; I guess it has been years.&nbsp; Entropy gets us all in the end.&nbsp; Sigh.&nbsp;"
    },
    {
      "author": "David*Guest*",
      "date": "11-04-2018",
      "text": "The last time there was a hiatus, there was a 2-year gap. J ended up burning out, and even Keith could not get in touch with him."
    },
    {
      "author": "cjack99*Guest*",
      "date": "12-14-2018",
      "text": "Merry Christmas to all,,,,,,,, maybe something will happen here in 2019, but I'm not holding my breath."
    }
  ]
}